In [6]:
import pandas  as pd
import numpy as np

## Libreria Pandas

* Libreria que permite manejar datos estructurados: Series (unidimensionales) y Dataframes (multidimensional).
* Son estructuras tabulares.
* Integra Numpy por debajo.
* Desarrollada en C.
* Almacena diferentes tipos de datos pero por columna han de ser homogeneos.
* Series: datos 1-D formados por un array de datos (Numpy) y un arrray de etiquetas (indices)
* Dataframes: estructura tabular de datos orientada a columnas con un array de etiquetas en las filas y otro para las columnas.

In [2]:
import subprocess
p=subprocess.run('pip install pandas', capture_output=True, text=True)
p.stdout.replace("\n","")

'Requirement already satisfied: pandas in c:\\users\\adria\\anaconda3\\lib\\site-packages (1.4.4)Requirement already satisfied: python-dateutil>=2.8.1 in c:\\users\\adria\\anaconda3\\lib\\site-packages (from pandas) (2.8.2)Requirement already satisfied: numpy>=1.18.5 in c:\\users\\adria\\anaconda3\\lib\\site-packages (from pandas) (1.21.5)Requirement already satisfied: pytz>=2020.1 in c:\\users\\adria\\anaconda3\\lib\\site-packages (from pandas) (2022.1)Requirement already satisfied: six>=1.5 in c:\\users\\adria\\anaconda3\\lib\\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)'

In [2]:
import pandas as pd
import numpy as np

### SERIES

* Creacion : Se construyen con el contructor pd.Series(). 
* Son tabulares y se estructuran como una columna.
* Admiten solo un tipo de dato por columna. Esto es relativo porque considera un tipo de dato 'object' donde mete lo que no es float.
   Es decir entonces que las Series pueden ser de float64, int64 (elementos de Numpy) u object (donde conviven otros tipos como int,str) 
* Tienen dos parametros principales
    
    * data: son los datos de la serie que pueden importarse a partir de un diccionario, array, lista o escalar.
    * index: son los indices de la serie que contiene la etiquetas para cada uno de los datos y se construyen exclusivamente a partir de un array o lista.

* Construccion a partir de un array o una lista

In [12]:
# Carga a partir de un array numpy
productos=pd.Series(data=np.array(['Guantes','Gorras','Toallas', 'Botas']), index=['Invierno','Primavera','Verano', 'Otoño'])
productos

# Observar que los strings son objects en pandas

Invierno     Guantes
Primavera     Gorras
Verano       Toallas
Otoño          Botas
dtype: object

In [5]:
# Carga a partir de una lista (tambien me lo permite ademas de cargar la data desde array numpy, puede ser lista) (idem al index)
productos2=pd.Series(data=['Guantes','Gorras','Toallas', 'Botas'], index=['Invierno','Primavera','Verano', 'Otoño'])
productos2

Invierno     Guantes
Primavera     Gorras
Verano       Toallas
Otoño          Botas
dtype: object

In [3]:
# Carga del index a partir de array numpy
productos3=pd.Series(data=['Guantes','Gorras','Toallas', 'Botas'], index=np.array(['Invierno','Primavera','Verano', 'Otoño']))
productos3

Invierno     Guantes
Primavera     Gorras
Verano       Toallas
Otoño          Botas
dtype: object

In [7]:
type(productos), type(productos2), type(productos3) # son lo mismo

(pandas.core.series.Series,
 pandas.core.series.Series,
 pandas.core.series.Series)

In [8]:
type(productos[0]), type(productos2[0]), type(productos3[0]) # y mismo contenido

(str, str, str)

In [9]:

# Observar que los strings son objects en numpy

In [10]:
type(productos)==type(productos2)==type(productos3) # mismo tipo de estructura

True

In [11]:
type(productos[0]) == type(productos2[0]) ==  type(productos3[0]) # mismo contenido

True

* Construccion a partir de un diccionario

In [23]:
empleados=pd.Series(data={'1ºTrim':18.9, '2ºTrim':20.3, '3ºTrim':15.4, '4ºTrim':16.2}, index=['1ºTrim','2ºTrim','3ºTrim','4ºTrim'])
empleados
# me da que lo del indice es redundante porque ya vienen en el diccionario

1ºTrim    18.9
2ºTrim    20.3
3ºTrim    15.4
4ºTrim    16.2
dtype: float64

In [13]:
empleados2=pd.Series(data={'1ºTrim':18.9, '2ºTrim':20.3, '3ºTrim':15.4, '4ºTrim':16.2}) # Quite la parte del index y parece lo mismo
empleados2 # se ve que es redundante poner el indice porque en un diccionario ya estan las etiquetas puestas.

1ºTrim    18.9
2ºTrim    20.3
3ºTrim    15.4
4ºTrim    16.2
dtype: float64

In [14]:
# verifico que sea lo mismo
type(empleados), type(empleados2)

(pandas.core.series.Series, pandas.core.series.Series)

In [15]:
type(empleados[0]), type(empleados2[0])

(numpy.float64, numpy.float64)

* Construccion a partir de un escalar

In [29]:
perdidas=pd.Series(data=7, index = ['1ºTrim','2ºTrim','3ºTrim','4ºTrim'])
perdidas

1ºTrim    7
2ºTrim    7
3ºTrim    7
4ºTrim    7
dtype: int64

* Consulta y manipulacion

In [17]:
type(perdidas) # productos es una serie

pandas.core.series.Series

In [18]:
# aca estan los TRES TIPOS DE DATOS QUE CONTIENEN LOS 'DATA' DE LAS SERIES

# dtype data-type (Es el tipo de los datos del array de values)

print(productos.dtype,empleados.dtype,perdidas.dtype)

object float64 int64

In [71]:
productos.dtype, empleados.dtype, perdidas.dtype # en productos devuelve '0' porque es object por eso se hace un print

(dtype('O'), dtype('float64'), dtype('int64'))

In [69]:
productos

Invierno     Guantes
Primavera     Gorras
Verano       Toallas
Otoño          Botas
dtype: object

In [16]:
print(productos.dtype), productos.dtype # ¿? HAY QUE HACER UN PRINT PARA VERLO BIEN

object

(None, dtype('O'))

In [24]:
empleados.values # es lo que esta cargado como data

array([18.9, 20.3, 15.4, 16.2])

In [25]:
type(empleados.values), type(empleados.values[0]) # el tipo de values es un array numpy, y el array esta formado por datos float64

(numpy.ndarray, numpy.float64)

In [21]:
type(empleados2.values), type(empleados2.values[0])

(numpy.ndarray, numpy.float64)

In [23]:
type(productos.values), type(productos.values[0])

(numpy.ndarray, str)

In [24]:
type(productos2.values), type(productos2.values[0])

(numpy.ndarray, str)

In [25]:
type(productos3.values), type(productos3.values[0]) # tambien son iguales observando 'values'

(numpy.ndarray, str)

In [26]:
empleados.values # recupera los valores de DATA

array([18.9, 20.3, 15.4, 16.2])

In [27]:
empleados.index # recupera los INDICES

Index(['1ºTrim', '2ºTrim', '3ºTrim', '4ºTrim'], dtype='object')

In [30]:
perdidas.shape # tamaño de la serie (filas y columnas). 
# Como hay solo una columna en la serie lo indica con la , y luego nada.

(4,)

In [29]:
perdidas.size # numero de objetos de la serie

4

In [32]:
perdidas.ndim # las Series solo tienen una sola dimension

1

In [30]:
empleados>0.5 # evalua la condicion elemento a elemento y devuelve un array booleano

1ºTrim    True
2ºTrim    True
3ºTrim    True
4ºTrim    True
dtype: bool

In [31]:
empleados[empleados>0.5] # Evalua y recupera los elementos que cumplen la condicion logica

#Cuando se ponen los dobles [[]] es porque estamos pasando una lista para que se realize la condicion logica. 
# Es una lista o array por eso va []

1ºTrim    18.9
2ºTrim    20.3
3ºTrim    15.4
4ºTrim    16.2
dtype: float64

In [33]:
empleados["2ºTrim"] # consulta por indice de etiqueta

20.3

In [34]:
empleados[1] # consulta por indice numerico

20.3

In [35]:
empleados.loc["2ºTrim"] # consulta por propiedad especifica (LOC) de una ETIQUETA. 

#Es mas eficiente. Es como los accesos por indices de las BBDD. Como nueve veces las rapido.

20.3

In [36]:
empleados.iloc[2]  # consulta por propiedad especifica (ILOC) de un INDICE. Lo mismo, mayor eficiencia. Mas rapido.

15.4

In [37]:
empleados["2ºTrim"]=23.99 #asignacion (modificacion de los valores de la serie) OJO! con la igualdad, va con doble ==

In [38]:
empleados[0]=99.23 #asignacion (modificacion de los valores de la serie)

In [39]:
empleados["1ºTrim":"3ºTrim"] # consulta de un conjunto de datos por etiquetas (aqui SI INCLUYE EL ELEMENTO FINAL) 
                                # Las etiquetas no comienzan en 0 por eso se incluye el final del rango, supongo.

1ºTrim    99.23
2ºTrim    23.99
3ºTrim    15.40
dtype: float64

In [40]:
empleados.loc["1ºTrim":"3ºTrim"] # consulta de un conjunto de datos por propiedad especifica (LOC) por ETIQUETA

1ºTrim    99.23
2ºTrim    23.99
3ºTrim    15.40
dtype: float64

In [41]:
empleados[2:4] # consulta de un conjunto de datos por indice (NO incluye el final)

3ºTrim    15.4
4ºTrim    16.2
dtype: float64

In [42]:
empleados.iloc[0:4] # consulta de un conjunto de datos por propiedad especifica (ILOC) por INDICE. Son 4 elementos de 0 a 3.

1ºTrim    99.23
2ºTrim    23.99
3ºTrim    15.40
4ºTrim    16.20
dtype: float64

In [43]:
empleados["1ºTrim":"3ºTrim"]=9999 # asignacion o modificacion multiple por etiqueta continua

In [ ]:
empleados["1ºTrim":"3ºTrim"]=[40,60,80] # asignacion o modificacion multiple por etiqueta continua con distintos valores

In [52]:
empleados[0:3]=9999 # asignacion o modificacion multiple por indice continua

In [53]:
empleados

1ºTrim    9999.0
2ºTrim    9999.0
3ºTrim    9999.0
4ºTrim      16.2
dtype: float64

In [54]:
empleados["1ºTrim","3ºTrim"]=90 # asignacion discreta (solo UNA posicion) por etiqueta

In [55]:
empleados

1ºTrim      90.0
2ºTrim    9999.0
3ºTrim      90.0
4ºTrim      16.2
dtype: float64

In [60]:
empleados.iloc[[0,3]]=20 # modificacion discreta (solo UNA posicion) por indice. Observar doble [].

In [61]:
empleados

1ºTrim      20.0
2ºTrim    9999.0
3ºTrim      90.0
4ºTrim      20.0
dtype: float64

In [63]:
empleados["1ºTrim","3ºTrim"]=[40,60] # modificacion discreta (solo UNA posicion) por etiqueta CON DISTINTOS VALORES.

In [36]:
empleados

1ºTrim    40.0
2ºTrim    60.0
3ºTrim    80.0
4ºTrim    16.2
dtype: float64

In [65]:
empleados[0:2]=[3,6]  # modificacion continua por etiqueta indice con distintos valores

In [66]:
empleados

1ºTrim     3.0
2ºTrim     6.0
3ºTrim    60.0
4ºTrim    20.0
dtype: float64

NOTA: LAS ASIGNACIONES/MODIFICACIONES TAMBIEN SE PUEDEN HACER MEDIANTE LOC/ILOC

In [70]:
empleados.iloc[0:2]=[3,6] # asignacion continua por indice

In [71]:
empleados

1ºTrim     3.0
2ºTrim     6.0
3ºTrim    60.0
4ºTrim    20.0
dtype: float64

In [40]:
empleados.loc["1ºTrim":"3ºTrim"]=[40,60,80] # asignacion continua por etiqueta

In [39]:
empleados

1ºTrim    40.0
2ºTrim    60.0
3ºTrim    80.0
4ºTrim    16.2
dtype: float64

In [42]:
empleados.loc["1ºTrim":"3ºTrim"]

1ºTrim    40.0
2ºTrim    60.0
3ºTrim    80.0
dtype: float64

In [75]:
productos

Invierno     Guantes
Primavera     Gorras
Verano       Toallas
Otoño          Botas
dtype: object

In [43]:
productos.value_counts() # recuento por valores (la columna de datos). Contar values.

Guantes    1
Gorras     1
Toallas    1
Botas      1
dtype: int64

In [79]:
## cambiar el valor de los indices 
productos.index=['Inv','Pri','Ver','Oto'] # asigna nuevos valores para los indices/etiquetas
productos

Inv    Guantes
Pri     Gorras
Ver    Toallas
Oto      Botas
dtype: object

In [80]:
# vuelvo a dejar los mismos indices
productos.index=['Invierno','Primavera','Verano','Otoño'] # asigna nuevos valores para los indices/etiquetas

####  Muestra aleatoria de datos M.A.S. (muestra aleatoria simple)

Funcion sample()

Parametros:

* n numero de elementos o bien frac indica el porcentaje de los datos que quiero obtener (ej .5 es el 50%)
* random_state para definir la semilla (en caso de que queramos reproducir mas adelante la misma muestra)
* replace= True con reemplazo, significa que los datos se pueden repetir.

In [81]:
empleados.count()

4

In [82]:
empleados.sample(n=3, random_state=999, replace=True) 

# M.A.S muestra aleatoria simple de 3 elementos CON reemplazamiento puede repetir los mismos datos (si los quiero diferentes replace=False)

1ºTrim    40.0
1ºTrim    40.0
2ºTrim    60.0
dtype: float64

In [83]:
empleados.sample(frac= .5, random_state=999, replace=False) 

# M.A.S muestra aleatoria simple del 50% elementos SIN reemplazamiento No se repiten los mismos datos.

3ºTrim    60.0
2ºTrim    60.0
dtype: float64

La semilla (random_state) sirve para generar siempre la misma muestra en caso de que queramos recrear el mismo proceso con mismos datos, aunque sean aleatorios, para ciertos casos es util poder reproducir la misma muestra.

####  Borrar elementos

* Borrar un único elemento de la serie df.pop('etiqueta') NO NECESITA CONFIRMACION

* Borrar más de un elemento de la serie df.drop([lista de etiquetas]) NECESITA CONFIRMACION

In [84]:
productos.pop('Invierno') # Borra la primera aparicion del valor con etiqueta 'Invierno'. Solo borra UNA.

'Guantes'

In [85]:
productos # eliminado Invierno 
# pop NO NECESITA CONFIRMACION ni ningun otro argumento para indicar que elimine efectivamente el valor.

Primavera     Gorras
Verano       Toallas
Otoño          Botas
dtype: object

In [87]:
# Para borrar MAS DE UN elemento uso drop y paso un array, 
# inplace = True borra efectivamente. De la otra forma inplace=False me muestra lo que borraria pero no lo borra en realidad.

# SIN BORRADO
productos.drop(['Otoño', 'Verano'], inplace=False)

Primavera    Gorras
dtype: object

In [88]:
productos # no los ha borrado

Primavera     Gorras
Verano       Toallas
Otoño          Botas
dtype: object

In [89]:
# BORRANDO
productos.drop(['Otoño', 'Verano'], inplace=True)
productos

Primavera    Gorras
dtype: object

#### Condicion WHERE. 

    * Funcion df.where('condiciondevariable', valoropcional, inplace=True)   "inplace opcional por defecto False"

El valor opcional reemplaza los datos que NO cumplen la condicion. 

Seria como decir: devuelvemos los datos que cumplen esta condicion y a los que no reemplazalos por valor opcional.

In [91]:
empleados[empleados<50]  # solo recupero los valores que cumplen la condicion

1ºTrim    40.0
4ºTrim    20.0
dtype: float64

In [92]:
empleados

1ºTrim    40.0
2ºTrim    60.0
3ºTrim    60.0
4ºTrim    20.0
dtype: float64

In [93]:
empleados.where(empleados<57)  # recupera todos los valores, LOS QUE CUMPLEN COMO ESTAN Y LOS QUE NO COMO NaN.

1ºTrim    40.0
2ºTrim     NaN
3ºTrim     NaN
4ºTrim    20.0
dtype: float64

In [94]:
empleados.where(empleados>20) # devuelve nan donde no se da la condicion

1ºTrim    40.0
2ºTrim    60.0
3ºTrim    60.0
4ºTrim     NaN
dtype: float64

In [48]:
empleados.where(empleados>20, 300) # Reemplaza los que NO cumplen la condicion por 300, en lugar de ponerlo como NaN.

# Ojo que reemplaza los que NO cumplen la condicion. NO los que la cumplen. En este caso 4ºTrim era 20.0 y no cumplia la cond.

1ºTrim     40.0
2ºTrim     60.0
3ºTrim     80.0
4ºTrim    300.0
dtype: float64

In [47]:
empleados # Solo hace el reemplazo en la visualizacion. No asigna el valor efectivamente.

1ºTrim    40.0
2ºTrim    60.0
3ºTrim    80.0
4ºTrim    16.2
dtype: float64

In [49]:
empleados.where(empleados>20, 300, inplace=True) # ahora si hizo efectivo el cambio

In [50]:
empleados

1ºTrim     40.0
2ºTrim     60.0
3ºTrim     80.0
4ºTrim    300.0
dtype: float64

#### Suma de columnas de distintas Series que tienen la misma etiqueta

Tambien se pueden realizar otras operaciones como suma de escalar, division, etc.

In [97]:
produccion1=pd.Series(data=[50,125,222],index=['Enero','Febrero','Marzo'])

In [98]:
produccion2=pd.Series(data=[50,125,222],index=['Abril','Mayo','Junio'])

In [99]:
produccion1bis=pd.Series(data=[1,1,1],index=['Enero','Febrero','Marzo'])

In [100]:
produccion1+produccion1bis # Suma los valores con la misma etiqueta

Enero       51
Febrero    126
Marzo      223
dtype: int64

In [101]:
produccion1+produccion2 
# No hay etiquetas coincidentes la suma no se realiza pero concatena las etiquetas de ambas series con resultado NaN
# ordeno alfabeticamente

Abril     NaN
Enero     NaN
Febrero   NaN
Junio     NaN
Marzo     NaN
Mayo      NaN
dtype: float64

In [102]:
produccion1/produccion1bis # Lo mismo que en la suma, mismas etiquetas por tanto realiza la operacion.

Enero       50.0
Febrero    125.0
Marzo      222.0
dtype: float64

In [103]:
produccion1+5 # suma 5 a todos

Enero       55
Febrero    130
Marzo      227
dtype: int64

#### Funcion concat (se amplia mas adelante)

In [104]:
pd.concat([produccion1,produccion2]) # Como se le pasa un conjunto de datos/argumentos deben ir como lista []
# a diferencia de la + (que trajo todo en nan) aqui si que trajo los valores de data

Enero       50
Febrero    125
Marzo      222
Abril       50
Mayo       125
Junio      222
dtype: int64

#### Aplicar funciones sobre series ( apply )

Funcion df.apply(\<funcion a aplicar a la serie>)

La funcion aplicada NO modifica la variable sobre la cual se aplica. Solo muestra el resultado de aplicar la funcion.

In [52]:
concentracion=pd.Series(data=[10,20,14,11], index=['a','b','c','d'])
concentracion

a    10
b    20
c    14
d    11
dtype: int64

In [106]:
def funcion(x):
    if x%2!=0: # impar
        return x+100
    else:
        return x

In [107]:
concentracion.apply(funcion)

a     10
b     20
c     14
d    111
dtype: int64

In [108]:
concentracion # no se ha modificado la serie, si quiero modificarla tengo que asignar a la serie

a    10
b    20
c    14
d    11
dtype: int64

Aplicar funcion LAMBDA (en este caso con asignacion)

In [109]:
concentracion=concentracion.apply(lambda x:x**2)
concentracion

a    100
b    400
c    196
d    121
dtype: int64

NOTA: USAR FOR EN SERIES NO ES EFICIENTE. CREAR FUNCION Y APLICAR ( apply() ) EN REEMPLAZO DE FOR O MAP.

NOTA: UTILIZAR LOC/ILOC SIEMPRE QUE SE PUEDA PUESTO QUE ES MAS EFICIENTE (RECORRE POR INDICES/VECTORES)

####  Funciones estadisticas básicas

In [110]:
concentracion.describe() # nos devuelve un resumen estadístico de los datos

# La mediana coincide con el percentil 50%, 
# como no tiene valor central, en este caso esta calculada como la media de los valores medios en este caso (121 y 196)

count      4.000000
mean     204.250000
std      136.851197
min      100.000000
25%      115.750000
50%      158.500000
75%      247.000000
max      400.000000
dtype: float64

In [54]:
# Como se calcularia la mediana si tuviera 5 datos en lugar de 4
concentracion2=pd.Series(data=[10,20,14,11,50])
concentracion2

0    10
1    20
2    14
3    11
4    50
dtype: int64

In [56]:
concentracion2.describe()
# Datos ordenados: 10,11,14,20,50 
# la mediana es 14 (es el valor central)

count     5.000000
mean     21.000000
std      16.673332
min      10.000000
25%      11.000000
50%      14.000000
75%      20.000000
max      50.000000
dtype: float64

In [64]:
concentracion.std(), concentracion.mean(), concentracion.median(), concentracion.max(), concentracion.min(),\
concentracion.count(), concentracion.sum(), concentracion.quantile(.75)
# desviacion std, media, mediana, maximo, minimo, conteo/cantidad, suma, percentil 75, etc.

(4.5, 13.75, 12.5, 20, 10, 4, 55, 15.5)

In [114]:
 np.percentile(concentracion, 75) # otra para los percentiles

247.0

#### Cambio del tipo de dato

          funcion astype()       argumentos: np.float64, np.int64

In [115]:
type(concentracion) # aqui devuelve el tipo de objeto de pandas

pandas.core.series.Series

In [116]:
concentracion.dtype # devuelve el tipo de dato de la serie 'data-type'

dtype('int64')

In [72]:
concentracion.astype(np.float64) # Cambio del tipo de dato de la serie (son tipos de numpy)

a    10.0
b    20.0
c    14.0
d    11.0
dtype: float64

In [73]:
concentracion.astype(np.int64)

a    10
b    20
c    14
d    11
dtype: int64

In [74]:
concentracion.astype(np.object)

C:\Users\carolina\AppData\Local\Temp\ipykernel_15132\2228230361.py:1: DeprecationWarning: `np.object` is a deprecated alias for the builtin `object`. To silence this warning, use `object` by itself. Doing this will not modify any behavior and is safe.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  concentracion.astype(np.object)

a    10
b    20
c    14
d    11
dtype: object

* DATOS ESPECIALES (missing):
    * NaN (not a number) Significa que no es un numero y procede de una indeterminacion. Ej: 0/0
    * NA (not aviable) Significa no disponible (null de sql) y procede de varias causas (consecuencia de cohercion, falta genetica¿?).

In [118]:
pd.Series(data=[10,20,None], index=['a','b','c']) # None define un valor faltante. Se muestra como NaN supongo porque son np.float

# Observar que los datos de la serie son de tipo float por tanto None se ha transformado a NaN de Numpy

a    10.0
b    20.0
c     NaN
dtype: float64

In [75]:
pd.Series(data=[10,20,np.nan], index=['a','b','c']) # tambien se puede cargar como un nan de numpy

a    10.0
b    20.0
c     NaN
dtype: float64

In [119]:
pd.Series(data=['A','B',None], index=['a','b','c']) # Aqui los elementos son strings y aparece el faltante como None.
                                            # Arriba ha hecho la cohercion a nulo de Numpy, aqui no porque los datos son str.

a       A
b       B
c    None
dtype: object

In [120]:
type(pd.Series(data=['A','B',None], index=['a','b','c'])['a']) # None seria el valor faltante en objects (por ej cuando son str)

str

In [121]:
pd.Series(data=[10,20,np.nan], index=['a','b','c']) # NaN define un valor faltante como estructura de Numpy. Tal como lo vemos arriba.

a    10.0
b    20.0
c     NaN
dtype: float64

In [122]:
pd.Series(data=[10,20,'NA'], index=['a','b','c']) # NA Se carga como un str

a    10
b    20
c    NA
dtype: object

In [76]:
# En la construccion de la serie anterior tenemos tanto enteros como el string 'NA'. La serie indica dtype=object
# Como object mete todo lo que no sea float. OBSERVACION: algunos elementos son int y otros str en la misma serie!!!!

In [124]:
type(pd.Series(data=[10,20,'NA'], index=['a','b','c'])['a'])

int

In [125]:
type(pd.Series(data=[10,20,'NA'], index=['a','b','c'])['c'])

str

In [126]:
pd.Series(data=[10,20,'NaN'], index=['a','b','c']) # NaN idem anterior. 'NaN' es un str y se carga como tal

a     10
b     20
c    NaN
dtype: object

In [127]:
type(pd.Series(data=[10,20,'NaN'], index=['a','b','c'])['a'])

int

In [128]:
type(pd.Series(data=[10,20,'NaN'], index=['a','b','c'])['c'])

str

###### Cuando la serie es de tipo object significa que carga diferentes tipos de datos (algunos de los cuales son caracter) o que son todos caracteres

##### Datos nulos, faltantes, erroneos

    Hay dos tipos de nulos: np.nan y None 

    Otros pueden verse como nulos pero ser de tipo str

In [7]:
objetos=pd.Series(data=[10,'NaN',20,np.nan,14,None,'NA'], index=['a','b','c','d','e','f','g']) # colocamos todos lo valores descriptos antes

In [8]:
objetos # 'NaN' y np.nan se ven igual pero no son lo mismo

a      10
b     NaN
c      20
d     NaN
e      14
f    None
g      NA
dtype: object

In [131]:
objetos['b'], objetos['d'],  objetos['f'],  objetos['g']

('NaN', nan, None, 'NA')

In [132]:
type(objetos['b']), type(objetos['d']),  type(objetos['f']),  type(objetos['g'])

# el primero y el ultimo son claramente str
# el segundo es un NaN de Numpy por eso pone Float
# el tercero es un None de Pandas

(str, float, NoneType, str)

In [9]:
objetos

a      10
b     NaN
c      20
d     NaN
e      14
f    None
g      NA
dtype: object

##### Buscar/obtener/filtrar NO NULOS

    funciones:  notnull(), notna(), dropna()

In [10]:
# data=[10,'NaN',20,np.nan,14,None,'NA']

objetos.notnull()  # solo son null np.nan y None 
                    # Si quiero considerar 'NaN' y 'NA' como nulos hay que cambiarlos a None por ejemplo o tratarlos aparte.

a     True
b     True
c     True
d    False
e     True
f    False
g     True
dtype: bool

In [11]:
objetos.notna() # lo mismo que notnull()

a     True
b     True
c     True
d    False
e     True
f    False
g     True
dtype: bool

In [12]:
objetos[objetos.notnull()] # d y f nulos correcto!

a     10
b    NaN
c     20
e     14
g     NA
dtype: object

In [13]:
objetos[objetos.notna()]  # d y f nulos correcto!

a     10
b    NaN
c     20
e     14
g     NA
dtype: object

In [19]:
objetos.dropna()  # d y f nulos correcto!
# esta funcion elimina los nulos para la visualizacion (inplace=False por defecto)

a     10
b    NaN
c     20
e     14
g     NA
dtype: object

##### Buscar/obtener/filtrar NULOS

    Si lo que necesito es identificar los nulos

In [20]:
objetos[objetos.isnull()] # aqui tengo los nulos

d     NaN
f    None
dtype: object

In [24]:
objetos[objetos.isna()]  # aqui tengo los nulos

d     NaN
f    None
dtype: object

In [17]:
objetos[objetos.notnull()==False] # aqui tengo los nulos

d     NaN
f    None
dtype: object

In [27]:
objetos[objetos.notna()==False] # aqui tengo los nulos

Series([], dtype: object)

In [31]:
objetos[objetos.fillna(0)==0] # esta podria ser otra forma de verlos, aunque no la veo muy apropiada

d    0
f    0
dtype: object

In [26]:
 # esta funcion reemplaza los nulos por el valor argumento

objetos.fillna(0, inplace=True) # Solo para visualizacion sin Inplace. Inplace=True para confirmar.

##### Buscar/obtener/filtrar iguales o diferentes a un valor dado

In [102]:
objetos[objetos=='NaN']
#empleados.where(empleados<57)

b    NaN
dtype: object

In [120]:
objetos[objetos!='NaN']

a      10
c      20
d     NaN
e      14
f    None
g      NA
dtype: object

In [122]:
objetos[objetos!=10]

b     NaN
c      20
d     NaN
e      14
f    None
g      NA
dtype: object

In [95]:
objetos

a      10
b     NaN
c      20
d     NaN
e      14
f    None
g      NA
dtype: object

##### Borrar nulos (None y np.nan)

    funcion dropna()    argumento inplace opcional

In [139]:
objetos

a      10
b     NaN
c      20
d     NaN
e      14
f    None
g      NA
dtype: object

In [138]:
objetos.dropna() # d y f eran nulos (None y np.nan)
# aqui no elimina efectivamente los nulos

a     10
b    NaN
c     20
e     14
g     NA
dtype: object

In [140]:
objetos.dropna(inplace=True) # aqui si los ha eliminado

In [141]:
objetos

a     10
b    NaN
c     20
e     14
g     NA
dtype: object

##### Reemplazar nulos (None y np.nan)

    funcion fillna(<valor de reemplazo>)    argumento inplace opcional

In [147]:
objetos=pd.Series(data=[10,'NaN',20,np.nan,14,None,'NA'], index=['a','b','c','d','e','f','g']) # colocamos todos lo valores descriptos antes

In [149]:
objetos

a      10
b     NaN
c      20
d     NaN
e      14
f    None
g      NA
dtype: object

In [150]:
objetos.fillna(0)

a     10
b    NaN
c     20
d      0
e     14
f      0
g     NA
dtype: object

In [151]:
objetos.fillna(0, inplace=True)
objetos

a     10
b    NaN
c     20
d      0
e     14
f      0
g     NA
dtype: object

##### Funciones any() y all()

Para consultar si alguno o todos los elementos son True

In [136]:
empleados<10

1ºTrim    False
2ºTrim    False
3ºTrim    False
4ºTrim    False
dtype: bool

In [137]:
a=empleados<10
a.any()  # Significa ¿Algun elemento es True?

False

In [138]:
a.all() # Significa ¿Todos los elementos son True?

False

In [139]:
# Para seleccionar mediante un array de booleanos

In [140]:
empleados[a] # no devuelve nada porque todos los elementos del array son falsos

Series([], dtype: float64)

In [141]:
# es igual que poner
empleados[[True,True, False, False]]

1ºTrim    40.0
2ºTrim    60.0
dtype: float64

In [144]:
# e igual que poner 
empleados[empleados<50] # los [] llevan la condicion

1ºTrim    40.0
4ºTrim    20.0
dtype: float64

##### Otro ejemplo para any() y all() combinado con notnull(), notna()

In [156]:
objetos=pd.Series(data=[10,'NaN',20,np.nan,14,None,'NA'], index=['a','b','c','d','e','f','g']) # colocamos todos lo valores descriptos antes
objetos.notnull()

a     True
b     True
c     True
d    False
e     True
f    False
g     True
dtype: bool

In [158]:
any(objetos.notnull()) # ALGUNO de los objetos SON NO NULOS (verdadero) ????

True

In [159]:
all(objetos.notnull()) # TODOS los objetos SON NO NULOS (verdadero) ????

False

### DATA FRAMES

Tiene dos o mas columnas (dimensiones)

#### CREACION DE DATAFRAMES

* Se crean con la funcion pd.DataFrame(<argumentos>)
    

* Tiene 4 parametros/argumentos principales:

     * data='': - define los datos que pueden proceder de una matriz, un diccionario u otro dataframe. REQUERIDO. 
     * index='': - define las etiquetas para cada dato a nivel de fila. Cada una de las filas es un array/vector o registro. NO REQUERIDO (por defecto numerico secuencial ascendente).
     * columns='': - define las etiquetas para cada dato a nivel de columna.NO REQUERIDO
     * dtype='': - permite definir el tipo de dato a aplicar. Solo se permite un tipo de dato por columna (se suele generar de forma automatica)
    
    
* Pueden tener filas repetidas.

In [145]:
import pandas as pd

##### Creacion a partir de una matriz

In [146]:
tabla_periodica=pd.DataFrame(
    data=[[1,1.0008,'No Metal'],[6,12.011,'No Metal'],[47,107.870,'Metal'],[88,226.000,'Metal']],  # arrays de arrays, cada uno de los arrays de dentro sera una fila
    index=['H','C','Ag','Ra'], # las etiquetas de indice
    columns=['NumeroAtomico','MasaAtomica','Familia'] # las etiquetas de columna
)
tabla_periodica

    NumeroAtomico  MasaAtomica   Familia
H               1       1.0008  No Metal
C               6      12.0110  No Metal
Ag             47     107.8700     Metal
Ra             88     226.0000     Metal

##### Creacion a partir de un diccionario

In [147]:

ventas=pd.DataFrame(data={'Producto':['Secador','Peine','Tijeras'],
                          'Precio':[35,12.6,6.5],
                            'Impuesto':[21,21,21],
                          'Stock':[10,30,23]},
                        index=['0801','1002','4003']) # esto que esta en el indice bien podria ser el codigo del producto

In [148]:
ventas

     Producto  Precio  Impuesto  Stock
0801  Secador    35.0        21     10
1002    Peine    12.6        21     30
4003  Tijeras     6.5        21     23

Arriba van las variables=caracteristicas de los objetos o nombres de columnas.

##### Creacion a partir de un array de diccionarios

In [149]:
uds_2009={'adidas':0,'newbalance':10,'puma':30,'rebook':200}
uds_2010={'adidas':5,'newbalance':20,'puma':100,'rebook':10}
uds_2011={'adidas':15,'newbalance':33,'puma':67,'rebook':19}
uds_2012={'adidas':35,'newbalance':27,'puma':77,'rebook':10}
uds_2013={'adidas':21,'newbalance':19,'puma':80,'rebook':20}
uds_2014={'adidas':15,'newbalance':25,'puma':120,'rebook':29}
uds_2015={'adidas':26,'newbalance':40,'puma':92,'rebook':19}

uds_2016={'adidas':8,'newbalance':52,'puma':91,'rebook':41}
uds_2017={'adidas':10,'newbalance':35,'puma':15,'rebook':9}
uds_2018={'adidas':11,'newbalance':33,'puma':23,'rebook':11}
uds_2019={'adidas':20,'newbalance':35,'puma':41,'rebook':19}
uds_2020={'adidas':30,'newbalance':12,'puma':35,'rebook':20}
uds_2021={'adidas':40,'newbalance':60,'puma':69,'rebook':19}
uds_2022={'adidas':100,'newbalance':33,'puma':60,'rebook':30}

In [150]:
historico_09_15=pd.DataFrame(data=[uds_2009,uds_2010,uds_2011,uds_2012,uds_2013,uds_2014,uds_2015], index=[2009,2010,2011,2012,2013,2014,2015])
historico_16_22=pd.DataFrame(data=[uds_2016,uds_2017,uds_2018,uds_2019,uds_2020,uds_2021,uds_2022], index=[2016,2017,2018,2019,2020,2021,2022])
# Cargo por lista de diccionarios. Cada diccionario es una fila.

In [151]:
historico_09_15

      adidas  newbalance  puma  rebook
2009       0          10    30     200
2010       5          20   100      10
2011      15          33    67      19
2012      35          27    77      10
2013      21          19    80      20
2014      15          25   120      29
2015      26          40    92      19

#### Contatenacion de DataFrame. 

* Se realiza con la funcion pd.concat(<argumentos>).
* Los argumentos son:
    * [] :array de objetos dataframe
    * axis=0 si concatena por fila, axis=1 si concatena por columnas
        
        completar foto

In [152]:
historico_stock=pd.concat([historico_09_15,historico_16_22], axis=0) # concatena por fila axis=1  por columna
historico_stock

      adidas  newbalance  puma  rebook
2009       0          10    30     200
2010       5          20   100      10
2011      15          33    67      19
2012      35          27    77      10
2013      21          19    80      20
2014      15          25   120      29
2015      26          40    92      19
2016       8          52    91      41
2017      10          35    15       9
2018      11          33    23      11
2019      20          35    41      19
2020      30          12    35      20
2021      40          60    69      19
2022     100          33    60      30

#### Inspeccion del DF

##### Consultar el tipo de dato de cada una de las caracteristicas o variables del dataframe.

     \<dataframe\>.dtypes

In [153]:
ventas

     Producto  Precio  Impuesto  Stock
0801  Secador    35.0        21     10
1002    Peine    12.6        21     30
4003  Tijeras     6.5        21     23

In [154]:
ventas.dtypes

Producto     object
Precio      float64
Impuesto      int64
Stock         int64
dtype: object

##### Array de los indices (fila y columna)

          \<dataframe\>.index
            \<dataframe\>.columns

In [155]:
ventas

     Producto  Precio  Impuesto  Stock
0801  Secador    35.0        21     10
1002    Peine    12.6        21     30
4003  Tijeras     6.5        21     23

In [156]:
ventas.index

Index(['0801', '1002', '4003'], dtype='object')

In [157]:
ventas.columns

Index(['Producto', 'Precio', 'Impuesto', 'Stock'], dtype='object')

##### Dimensiones del dataframe

      <dataframe>.shape     Devuelve (nro_filas,nro_variables)
      <dataframe>.size      Devuelve numero de elementos (nro_filas*nro_variables)

In [158]:
ventas.shape # filas, columnas

(3, 4)

In [159]:
ventas.size

12

In [160]:
ventas.ndim # un DF tiene filas y columnas, es tabular por tanto tiene dos dimensiones.

2

In [118]:
ventas

     Producto  Precio  Impuesto  Stock
0801  Secador    35.0        21     10
1002    Peine    12.6        21     30
4003  Tijeras     6.5        21     23

##### Visualizacion previa del aspecto de los datos

      * <dataframe>.head()  muestra los primeros elementos del dataframe
      * <dataframe>.tail()  muestra los ultimos elementos del dataframe
      * <dataframe>.sample(n=N)  muestra aleatoria de N registros (N entero)
      * <dataframe>.describe()  muestra informacion estadistica resumida (quartiles, moda, frecuencia).
      * <dataframe>.info() muestra informacion resumida del dataframe

In [161]:
ventas.head()

     Producto  Precio  Impuesto  Stock
0801  Secador    35.0        21     10
1002    Peine    12.6        21     30
4003  Tijeras     6.5        21     23

In [162]:
ventas.tail()

     Producto  Precio  Impuesto  Stock
0801  Secador    35.0        21     10
1002    Peine    12.6        21     30
4003  Tijeras     6.5        21     23

In [163]:
ventas.sample(n=3) # muestra aleatoria

     Producto  Precio  Impuesto  Stock
1002    Peine    12.6        21     30
0801  Secador    35.0        21     10
4003  Tijeras     6.5        21     23

In [164]:
ventas.describe() # de las variables aleatorias

          Precio  Impuesto      Stock
count   3.000000       3.0   3.000000
mean   18.033333      21.0  21.000000
std    15.006776       0.0  10.148892
min     6.500000      21.0  10.000000
25%     9.550000      21.0  16.500000
50%    12.600000      21.0  23.000000
75%    23.800000      21.0  26.500000
max    35.000000      21.0  30.000000

In [165]:
ventas.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0801 to 4003
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Producto  3 non-null      object
 1   Precio    3 non-null      float64
 2   Impuesto  3 non-null      int64
 3   Stock     3 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 120.0+ bytes

#### Actualizacion/modificacion de los datos

##### Crear nuevas columnas

        <dataframe>['nombreNuevaVariable']=[<datos>] 
        
         Las opciones para datos son:
         
         * la lista con los datos [] 
         * por medio de calculos 
         * mediante escalar que se repite en todas las filas.

In [33]:
import numpy as np
np.random.seed(1976) # Fijo la semilla
df = pd.DataFrame(data = np.random.randn(5,4), # matriz de 5x4 de numeros aleatorios de distribucion normal gausiana
                  index = ['A','B','C','D','E'],
                  columns = ['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.350665  1.515996  0.885111 -0.661080
B -0.204711  3.104169  1.138570 -0.413935
C  1.142544 -0.843924 -0.186393  0.142881
D  1.407652  0.791607 -0.545165 -0.128504
E  1.409883 -0.997688 -0.773334  0.606940

In [173]:
df['Nueva']=df['W']*10-df['Y']/30 # mediante calculo

In [174]:
df

          W         X         Y         Z      Nueva
A -0.350665  1.515996  0.885111 -0.661080  -3.536151
B -0.204711  3.104169  1.138570 -0.413935  -2.085066
C  1.142544 -0.843924 -0.186393  0.142881  11.431653
D  1.407652  0.791607 -0.545165 -0.128504  14.094688
E  1.409883 -0.997688 -0.773334  0.606940  14.124611

In [175]:
# Crear la columna Nueva2 con nros 12 (Escalar)

df['Nueva2']=12
df

          W         X         Y         Z      Nueva  Nueva2
A -0.350665  1.515996  0.885111 -0.661080  -3.536151      12
B -0.204711  3.104169  1.138570 -0.413935  -2.085066      12
C  1.142544 -0.843924 -0.186393  0.142881  11.431653      12
D  1.407652  0.791607 -0.545165 -0.128504  14.094688      12
E  1.409883 -0.997688 -0.773334  0.606940  14.124611      12

In [176]:
df['Nueva3']=[10,11,12,13,15] # mediante lista
df

          W         X         Y         Z      Nueva  Nueva2  Nueva3
A -0.350665  1.515996  0.885111 -0.661080  -3.536151      12      10
B -0.204711  3.104169  1.138570 -0.413935  -2.085066      12      11
C  1.142544 -0.843924 -0.186393  0.142881  11.431653      12      12
D  1.407652  0.791607 -0.545165 -0.128504  14.094688      12      13
E  1.409883 -0.997688 -0.773334  0.606940  14.124611      12      15

##### Borrar/Eliminar columnas

        <dataframe>.drop(<etiqueta/indice de fila o col>, axis=0, inplace=True) 
        
                        # 0 filas, 1 columnas
                        # Para hacer efectivo el borrado inplace=True. Por defecto False
                        
       NOTA: con el inplace en defalut(False) puedo eliminar de la visualizacion las columnas que no me interesan. 
               Es otra manera de filtrar los datos.
                        
         del <dataframe>[<columnaABorrar>]  Es una funcion de alto nivel. Borra directamente.

In [177]:
df=df.drop('Nueva',axis=1) # elimina la columna. Tambien se puede indicar por indice numerico
df  # asigne por tanto se ha eliminado

          W         X         Y         Z  Nueva2  Nueva3
A -0.350665  1.515996  0.885111 -0.661080      12      10
B -0.204711  3.104169  1.138570 -0.413935      12      11
C  1.142544 -0.843924 -0.186393  0.142881      12      12
D  1.407652  0.791607 -0.545165 -0.128504      12      13
E  1.409883 -0.997688 -0.773334  0.606940      12      15

In [178]:
df=df.drop('E', axis=0) # elimina la fila. Tambien se puede indicar por indice numerico
df

          W         X         Y         Z  Nueva2  Nueva3
A -0.350665  1.515996  0.885111 -0.661080      12      10
B -0.204711  3.104169  1.138570 -0.413935      12      11
C  1.142544 -0.843924 -0.186393  0.142881      12      12
D  1.407652  0.791607 -0.545165 -0.128504      12      13

In [34]:
df=df.drop(['C','D'], axis=0) # elimina la fila. Tambien se puede indicar por indice numerico
df

          W         X         Y         Z
A -0.350665  1.515996  0.885111 -0.661080
B -0.204711  3.104169  1.138570 -0.413935
E  1.409883 -0.997688 -0.773334  0.606940

In [35]:
df=df.drop(['W','Y'], axis=1) # elimina la fila. Tambien se puede indicar por indice numerico
df

          X         Z
A  1.515996 -0.661080
B  3.104169 -0.413935
E -0.997688  0.606940

In [179]:
del df['Nueva2'] # funcion de alto nivel
df

          W         X         Y         Z  Nueva3
A -0.350665  1.515996  0.885111 -0.661080      10
B -0.204711  3.104169  1.138570 -0.413935      11
C  1.142544 -0.843924 -0.186393  0.142881      12
D  1.407652  0.791607 -0.545165 -0.128504      13

#### Consulta/Seleccion de los datos

#####  Recuperar una columna o conjunto de columnas mediante []

            <dataframe>['nombreVariable']
            <dataframe>[['nombreVariable1','nombreVariable2',...]]

In [180]:
import numpy as np

df2=pd.DataFrame(data=np.random.randn(5,4), index= ['A', 'B', 'C', 'D','E'], columns=['W', 'X', 'Y', 'Z'])

In [181]:
df2

          W         X         Y         Z
A -1.136748  1.083449  1.488967 -0.051547
B -0.273839 -0.222350  0.628574  1.183904
C  0.500753 -0.078337 -0.225181  0.335381
D -1.820918 -0.017031 -0.725816  2.002461
E -0.974926  1.697157  0.049759  0.789107

In [182]:
df['W']

A   -0.350665
B   -0.204711
C    1.142544
D    1.407652
Name: W, dtype: float64

In [183]:
df[['Y','W']]  # Para indicar mas de una columna lo hago con una lista. Respeta el orden indicado en la lista

          Y         W
A  0.885111 -0.350665
B  1.138570 -0.204711
C -0.186393  1.142544
D -0.545165  1.407652

##### Recuperacion de datos mediante LOC/ILOC

* Para recuperar/consultar filas 

        <dataframe>.loc[<nombreEtiqueta>]
         <dataframe>.iloc[<numeroIndice>]
         
* Para recuperar/consultar un solo elemento 

        <dataframe>.loc[<nombreEtiquetaFila>,<nombreEtiquetaColumna>]
        <dataframe>.iloc[<numeroIndiceFila>,<numeroIndiceColumna>]
     
     
    
    NOTA: NO SE PUEDE CONSULTAR SIN LOC ILOC COMO EN LAS SERIES QUE SE PUEDEN OBTENER LOS DATOS SOLO CON [] 
    
    ¿? No se a que se refiere con esto. Arriba hay consultas sin loc/iloc

In [184]:
df

          W         X         Y         Z  Nueva3
A -0.350665  1.515996  0.885111 -0.661080      10
B -0.204711  3.104169  1.138570 -0.413935      11
C  1.142544 -0.843924 -0.186393  0.142881      12
D  1.407652  0.791607 -0.545165 -0.128504      13

In [185]:
df.loc['A'] # es la fila A (etiqueta) solo que lo muestra en forma de columna

W         -0.350665
X          1.515996
Y          0.885111
Z         -0.661080
Nueva3    10.000000
Name: A, dtype: float64

In [186]:
df.iloc[0] # lo mismo pero por indice

W         -0.350665
X          1.515996
Y          0.885111
Z         -0.661080
Nueva3    10.000000
Name: A, dtype: float64

In [187]:
df.loc['A','W'] # fila,columna. Se separa por , si no quiero indicar fila pongo , sin nada por delante

-0.3506646851174367

In [188]:
df.iloc[0,0] # fila,columna

-0.3506646851174367

In [189]:
df.loc[['A','C'],['X','Y']] #  primero van las filas [si son mas de una], luego las columnas [si son mas de una]

          X         Y
A  1.515996  0.885111
C -0.843924 -0.186393

In [190]:
df.iloc[[0,2],[1,2]]  # primero van las filas, luego las columnas

          X         Y
A  1.515996  0.885111
C -0.843924 -0.186393

In [285]:
#Ejemplo:

import numpy as np
np.random.seed(1976)
df = pd.DataFrame(data = np.random.randn(5,4), # genera matriz de 5x4 con numeros aleatorios de distribucion normal
                  index = ['A','B','C','D','E'],
                  columns = ['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.350665  1.515996  0.885111 -0.661080
B -0.204711  3.104169  1.138570 -0.413935
C  1.142544 -0.843924 -0.186393  0.142881
D  1.407652  0.791607 -0.545165 -0.128504
E  1.409883 -0.997688 -0.773334  0.606940

##### Seleccion logica de datos

In [192]:
df>0.5 # Obtengo una matriz de datos booleanos

       W      X      Y      Z
A  False   True   True  False
B  False   True   True  False
C   True  False  False  False
D   True   True  False  False
E   True  False  False   True

In [193]:
# Para recuperar los DATOS que cumplen la condicion 

df[df>0.5] # el dataframe y el df de la condicion logica dentro de []

# Devuelve la matriz de datos de los que cumplen de la condicion y en los que no devuelve NaN

          W         X         Y        Z
A       NaN  1.515996  0.885111      NaN
B       NaN  3.104169  1.138570      NaN
C  1.142544       NaN       NaN      NaN
D  1.407652  0.791607       NaN      NaN
E  1.409883       NaN       NaN  0.60694

Ejercicio: realizar la consulta que devuelva aquellos valores de la columna W que sean mayores a 1.20

In [195]:
df[df['W']>1.20]['W'] # primero selecciono el df que cumple la condicion logica y luego me quedo solo con la columna W

D    1.407652
E    1.409883
Name: W, dtype: float64

Ejercicio: realiza una consulta que seleccione las filas de W > 1.15 y de esas filas extraer los valores de la columna Y

In [196]:
df

          W         X         Y         Z
A -0.350665  1.515996  0.885111 -0.661080
B -0.204711  3.104169  1.138570 -0.413935
C  1.142544 -0.843924 -0.186393  0.142881
D  1.407652  0.791607 -0.545165 -0.128504
E  1.409883 -0.997688 -0.773334  0.606940

In [197]:
df[df['W']>1.15]['Y']

D   -0.545165
E   -0.773334
Name: Y, dtype: float64

Ejercicio: realiza una consulta que selecione las filas de Z < 0 y de esas filas extraer todas las columnas menos la Y.

In [198]:
df[df['Z']<0].drop('Y',axis=1) # para quitar Y la borro sin borrar (solo la elimina de la visualizacion)

          W         X         Z
A -0.350665  1.515996 -0.661080
B -0.204711  3.104169 -0.413935
D  1.407652  0.791607 -0.128504

In [199]:
#df[df['Z']<0]['W','X','Z']

* Para recuperar los DATOS que cumplen VARIAS CONDICIONES LOGICAS

    df[() operador ()]

Ejercicio: Realizar una consulta que seleccione las filas W<0 y donde Y>0.5

In [200]:
df[df['W']<0]

          W         X         Y         Z
A -0.350665  1.515996  0.885111 -0.661080
B -0.204711  3.104169  1.138570 -0.413935

In [201]:
df[df['Y']>0.5]

          W         X         Y         Z
A -0.350665  1.515996  0.885111 -0.661080
B -0.204711  3.104169  1.138570 -0.413935

In [202]:
df[(df['W']<0) & (df['Y']>0.5)] # Meto dentro de los () las condiciones

          W         X         Y         Z
A -0.350665  1.515996  0.885111 -0.661080
B -0.204711  3.104169  1.138570 -0.413935

#### Aplicar funciones lambda a DataFrames

In [1]:
## funcion lambda con if/else

In [ ]:
df_mpg['marca']=df_mpg['name'].apply(lambda x: x[0:x.index(' ')].upper() if ' ' in x else x.upper())

##### Funcion de alto nivel QUERY (es igualmente eficiente pero aumenta la legilibilidad)

Observar la notacion: 

* la condicion deben ir entre 'condicion simple o compleja'. 
* las variables se nombran directamente sin entrecomillado.
* Los operadores para query son:
    
    * & operador and
    * | operador or
    * ~ operador not

In [203]:
df.query('W<0 & Y>0.5')['Z'] # la misma consulta anterior pero con query. Solo muestra la columna Z

A   -0.661080
B   -0.413935
Name: Z, dtype: float64

In [204]:
df

          W         X         Y         Z
A -0.350665  1.515996  0.885111 -0.661080
B -0.204711  3.104169  1.138570 -0.413935
C  1.142544 -0.843924 -0.186393  0.142881
D  1.407652  0.791607 -0.545165 -0.128504
E  1.409883 -0.997688 -0.773334  0.606940

Ejercicio: realizar una consulta donde W<0 y donde X>3 o que nueva3 tenga un valor positivo. Devolver todas las columnas.

In [205]:
df['Nueva3']=[10,11,12,13,14] # mediante lista
df

          W         X         Y         Z  Nueva3
A -0.350665  1.515996  0.885111 -0.661080      10
B -0.204711  3.104169  1.138570 -0.413935      11
C  1.142544 -0.843924 -0.186393  0.142881      12
D  1.407652  0.791607 -0.545165 -0.128504      13
E  1.409883 -0.997688 -0.773334  0.606940      14

In [206]:
df.query('W<0 & (X>3 | Nueva3>0)')

          W         X         Y         Z  Nueva3
A -0.350665  1.515996  0.885111 -0.661080      10
B -0.204711  3.104169  1.138570 -0.413935      11

#### Agrupacion de datos por filas

* Funcion de alto nivel .groupby('<variable>') 
    
Agrupa por la fila para posteriormente aplicar una funcion de alto nivel que calcule para cada agrupacion obteniendo informacion agregada de cada grupo.
    
* Parametros: 
    * by=\<variable> # variable o lista de variables [] a agregar 
    * sort=True # Ordena por el/los dato/s de agregacion.
    * dropna= False # Coge o no los None.
    
Las funciones de alto nivel que se pueden aplicar a groupby son:
    
    * mean()
    * std()
    * min()
    * max()
    * count()
    * median()
    * describe()
    * sum()
    
  NOTA: Siempre que se haga una agrupacion se debe indicar una funcion de agregacion y sobre que variable se va a calcular, sino calcula sobre todas.

In [36]:
dfC=pd.DataFrame({'Concesionario':['Madrid','Bilbao','Canarias','Barcelona','Valencia'],
    'Gerente':['Jorge','Iñaki','Jorge','Pau','Xavier'],
    'Personal':[30,20,10,30,25],
    'Ventas':[200,120,300,120,200]})

In [208]:
dfC

  Concesionario Gerente  Personal  Ventas
0        Madrid   Jorge        30     200
1        Bilbao   Iñaki        20     120
2      Canarias   Jorge        10     300
3     Barcelona     Pau        30     120
4      Valencia  Xavier        25     200

In [209]:
dfC.describe().transpose() # se ven los calculos en columnas
# se muestras las columnas numericas del DF

          count   mean        std    min    25%    50%    75%    max
Personal    5.0   23.0   8.366600   10.0   20.0   25.0   30.0   30.0
Ventas      5.0  188.0  74.296702  120.0  120.0  200.0  200.0  300.0

In [37]:
dfC.groupby(by='Gerente', sort=True).mean()[['Personal']] # Observar doble [[]] SE MUESTRA COMO TABLA!!

         Personal
Gerente
Iñaki        20.0
Jorge        20.0
Pau          30.0
Xavier       25.0

In [43]:
dfC.groupby(by='Gerente', sort=True).mean()[['Personal']].loc['Iñaki'][0] # despues de agrupar obtengo el dato que necesito

20.0

In [44]:
int(dfC.groupby(by='Gerente', sort=True).mean()[['Personal']].loc['Iñaki'][0]) ## ademas puedo anidar una transformacion de var

20

In [213]:
dfC.groupby(by='Concesionario').count() # sin no especifico calcula sobre todas las variables posibles.

               Gerente  Personal  Ventas
Concesionario
Barcelona            1         1       1
Bilbao               1         1       1
Canarias             1         1       1
Madrid               1         1       1
Valencia             1         1       1

In [214]:
dfC.groupby(by='Gerente').count()

         Concesionario  Personal  Ventas
Gerente
Iñaki                1         1       1
Jorge                2         2       2
Pau                  1         1       1
Xavier               1         1       1

In [215]:
dfC.groupby(by='Gerente').count().query('Ventas > 1') # para ver las filas que estan repetidas por Gerente
# inclui por detras del df que resulta de agrupar y contar, la query de ventas>1  REPETIDOS!!! DUPLICADOS!!

         Concesionario  Personal  Ventas
Gerente
Jorge                2         2       2

In [216]:
dfC

  Concesionario Gerente  Personal  Ventas
0        Madrid   Jorge        30     200
1        Bilbao   Iñaki        20     120
2      Canarias   Jorge        10     300
3     Barcelona     Pau        30     120
4      Valencia  Xavier        25     200

In [217]:
dfC.iloc[2,2]

10

In [218]:
dfC.groupby(by='Gerente',dropna=True).mean()  # En este caso el dropna da igual porq no hay nulos

         Personal  Ventas
Gerente
Iñaki        20.0   120.0
Jorge        20.0   250.0
Pau          30.0   120.0
Xavier       25.0   200.0

#### Pivot table - Funcion Groupby

In [45]:
import seaborn as sns

In [46]:
# help(sns.load_dataset)

In [47]:
titanic=sns.load_dataset('titanic')

In [182]:
# HE TENIDO QUE CARGARLO DESDE UN CSV QUE TENGO PORQUE NO ME VA EL LOAD_DATASET
# Reinicie el kernel y ya lo pude cargar desde Seaborn

In [183]:
# titanic=pd.read_csv(r'C:\Users\adria\Documents\Carol Formacion\Curso ML\python-ml-course-master\datasets\titanic\titanic_custom.csv', encoding= 'ISO-8859-1')

In [221]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

Ejercicio:

In [266]:
# Cuantas personas embarcaron en el titanic?
titanic.size # Esto esta fatal. Esto es el numero de datos (todos los valores de la tabla)

13365

In [278]:
titanic.index  # Fueron 891 pasajeros

RangeIndex(start=0, stop=891, step=1)

In [265]:
titanic.info() # Son 891 filas con 15 variables en total los 13365 datos

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [223]:
# Promedio de supervivientes por sexo
# Sobrevivieron muchas mas mujeres que hombres puesto que se les dio prioridad durante el salvamento

In [51]:
titanic.groupby(by='sex').mean().round(2)[['survived']] # con dos [] formato de tabla

        survived
sex
female      0.74
male        0.19

In [64]:
titanic.groupby(by='sex').mean().round(2)[['survived']]

        survived
sex
female      0.74
male        0.19

In [61]:
titanic.groupby(by='sex').mean().round(2).loc[:,'survived'][0] # mujeres

0.74

In [62]:
titanic.groupby(by='sex').mean().round(2).loc[:,'survived'][1] # hombres

0.19

In [226]:
# Promedio de supervivientes dividido por clase de billete 
# Se rescataron a mas personas de primera que de segunda y tercera.

In [65]:
titanic.groupby(by='class').mean().round(2)[['survived']] # 1 es primera, 2 segunda, 3 tercera (yo lo tengo codificado asi)

        survived
class
First       0.63
Second      0.47
Third       0.24

In [67]:
titanic.groupby(by='class').count()[['pclass']] # cantidad de pasajeros por clase (cuento y muestro cualquiera de las columnas) 
# Siendo que habia mas pasajeros de 3ra que de 1ra y 2da juntos.

        pclass
class
First      216
Second     184
Third      491

In [281]:
 216*0.63, 184*0.47, 491*0.24

(136.08, 86.47999999999999, 117.83999999999999)

In [228]:
# Promedio de supervivientes por genero y a su vez por clase
# Las mujeres de 1ra y 2da clase sobrevivieron casi todas.
# Las de 3ra sobrevivieron la mitad
# Entre los hombres los supervivientes de 1ra superan a los de 2da y 3ra juntos en porcentaje.

In [68]:
titanic.groupby(by=['sex','class']).mean().round(2)[['survived']] # agrupacion por mas de una columna

               survived
sex    class
female First       0.97
       Second      0.92
       Third       0.50
male   First       0.37
       Second      0.16
       Third       0.14

In [310]:
# Porcentaje de supervivientes
# 342/891 38% 

titanic['survived'].sum()/titanic['survived'].count()

0.3838383838383838

#### Indexacion / Reindexacion / Cambio de indices y etiquetas

In [291]:
df

          W         X         Y         Z
A -0.350665  1.515996  0.885111 -0.661080
B -0.204711  3.104169  1.138570 -0.413935
C  1.142544 -0.843924 -0.186393  0.142881
D  1.407652  0.791607 -0.545165 -0.128504
E  1.409883 -0.997688 -0.773334  0.606940

In [292]:
df.index # visualiacion de los indices (es un vector)

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [293]:
df.reset_index() # reseteo de indice (cambia a numerico entero desde 0)

# El antiguo indice queda en la columna index y reasigna un nuevo indice numerico secuencial

  index         W         X         Y         Z
0     A -0.350665  1.515996  0.885111 -0.661080
1     B -0.204711  3.104169  1.138570 -0.413935
2     C  1.142544 -0.843924 -0.186393  0.142881
3     D  1.407652  0.791607 -0.545165 -0.128504
4     E  1.409883 -0.997688 -0.773334  0.606940

In [294]:
df.iloc[0] # seleccion por fila 0, la muestra encolumnada !!!

W   -0.350665
X    1.515996
Y    0.885111
Z   -0.661080
Name: A, dtype: float64

In [295]:
df.index=[10,11,12,13,14] # Reidexacion por un indice diferente indicado mediante una lista/vector 
df

           W         X         Y         Z
10 -0.350665  1.515996  0.885111 -0.661080
11 -0.204711  3.104169  1.138570 -0.413935
12  1.142544 -0.843924 -0.186393  0.142881
13  1.407652  0.791607 -0.545165 -0.128504
14  1.409883 -0.997688 -0.773334  0.606940

In [296]:
df.columns=['Columna11','Columna12','Columna13','Columna14']
df

    Columna11  Columna12  Columna13  Columna14
10  -0.350665   1.515996   0.885111  -0.661080
11  -0.204711   3.104169   1.138570  -0.413935
12   1.142544  -0.843924  -0.186393   0.142881
13   1.407652   0.791607  -0.545165  -0.128504
14   1.409883  -0.997688  -0.773334   0.606940

In [297]:
df.columns

Index(['Columna11', 'Columna12', 'Columna13', 'Columna14'], dtype='object')

#### Funciones de combinacion de DFs: CONCAT()

* Funcion pd.concat()
* Parametros:

    * Los DFs a concatenar se indican dentro de una lista.
    * axis= 0/1 Indica el eje por el cual se concatena. 0 por filas y 1 por columnas.

Nota:

    * si concateno horizontalmente (por filas) los DFs deberian tener la misma cantidad de columnas. 
        Si no es asi se rellenan con NaN los faltantes.
    * si concateno verticalmente (por columnas) los DFs deberian tener la misma cantidad de filas.  
        Si no es asi se rellenan con NaN los faltantes

In [236]:
import pandas as pd

In [237]:
a = pd.DataFrame({'A':['a0','a1','a2','a3'],'B':['b0','b1','b2','b3'],'C':['c0','c1','c2','c3'],'D':['d0','d1','d2','d3']})
b = pd.DataFrame({'A':['a4','a5','a6','a7'],'B':['b4','b5','b6','b7'],'C':['c4','c5','c6','c7'],'D':['d4','d5','d6','d7']})
c = pd.DataFrame({'A':['a8','a9','a10','a11'],'B':['b8','b9','b10','b11'],'C':['c8','c9','c10','c11'],'D':['d8','d9','d10','d11']})

In [238]:
a

    A   B   C   D
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [239]:
b

    A   B   C   D
0  a4  b4  c4  d4
1  a5  b5  c5  d5
2  a6  b6  c6  d6
3  a7  b7  c7  d7

In [240]:
c

     A    B    C    D
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [241]:
pd.concat([a,b,c], axis=0) # concatena por fila

     A    B    C    D
0   a0   b0   c0   d0
1   a1   b1   c1   d1
2   a2   b2   c2   d2
3   a3   b3   c3   d3
0   a4   b4   c4   d4
1   a5   b5   c5   d5
2   a6   b6   c6   d6
3   a7   b7   c7   d7
0   a8   b8   c8   d8
1   a9   b9   c9   d9
2  a10  b10  c10  d10
3  a11  b11  c11  d11

In [313]:
# Al concatenar se duplicaron los indices
pd.concat([a,b,c], axis=0).iloc[0] # mismo resultado que abajo
#pd.concat([a,b,c], axis=0).iloc[0,:] # Solo me muestra el primero de los indices 0

A    a0
B    b0
C    c0
D    d0
Name: 0, dtype: object

In [242]:
pd.concat([a,b,c], axis=1) # concatena por columnas

    A   B   C   D   A   B   C   D    A    B    C    D
0  a0  b0  c0  d0  a4  b4  c4  d4   a8   b8   c8   d8
1  a1  b1  c1  d1  a5  b5  c5  d5   a9   b9   c9   d9
2  a2  b2  c2  d2  a6  b6  c6  d6  a10  b10  c10  d10
3  a3  b3  c3  d3  a7  b7  c7  d7  a11  b11  c11  d11

In [243]:
pd.concat([a,b,c], axis=1)[['A']] # las columnas A

    A   A    A
0  a0  a4   a8
1  a1  a5   a9
2  a2  a6  a10
3  a3  a7  a11

In [244]:
pd.concat([a,b,c], axis=1)[['A','B','C']] # orden de columnas (todas las A, todas las B, todas las C)

    A   A    A   B   B    B   C   C    C
0  a0  a4   a8  b0  b4   b8  c0  c4   c8
1  a1  a5   a9  b1  b5   b9  c1  c5   c9
2  a2  a6  a10  b2  b6  b10  c2  c6  c10
3  a3  a7  a11  b3  b7  b11  c3  c7  c11

NOTA: pandas permite indices de filas y/o columnas repetidas !!!!  madre mia

In [246]:
pd.concat([a,b,c], axis=1)[['A','B','C']]['A'] # si selecciono la columna A me muestra las tres A

    A   A    A
0  a0  a4   a8
1  a1  a5   a9
2  a2  a6  a10
3  a3  a7  a11

In [247]:
d = pd.DataFrame({'A':['a0','a1','a2','a3'],'B':['b0','b1','b2','b3'],'C':['c0','c1','c2','c3'],'D':['d0','d1','d2','d3']})
e = pd.DataFrame({'A':['a4','a5','a6','a7'],'B':['b4','b5','b6','b7'],'C':['c4','c5','c6','c7']}) # una columna menos

In [248]:
pd.concat([d,e], axis=0)

    A   B   C    D
0  a0  b0  c0   d0
1  a1  b1  c1   d1
2  a2  b2  c2   d2
3  a3  b3  c3   d3
0  a4  b4  c4  NaN
1  a5  b5  c5  NaN
2  a6  b6  c6  NaN
3  a7  b7  c7  NaN

In [316]:
pd.concat([d,e], axis=0)# .iloc[0]

    A   B   C    D
0  a0  b0  c0   d0
1  a1  b1  c1   d1
2  a2  b2  c2   d2
3  a3  b3  c3   d3
0  a4  b4  c4  NaN
1  a5  b5  c5  NaN
2  a6  b6  c6  NaN
3  a7  b7  c7  NaN

In [372]:
f = pd.DataFrame({'A':['a0','a1','a2','a3'],'B':['b0','b1','b2','b3'],'C':['c0','c1','c2','c3']})
g = pd.DataFrame({'A':['a4','a5'],'B':['b4','b5'],'C':['c4','c5']})

In [210]:
pd.concat([f,g], axis=1)

    A   B   C    A    B    C
0  a0  b0  c0   a4   b4   c4
1  a1  b1  c1   a5   b5   c5
2  a2  b2  c2  NaN  NaN  NaN
3  a3  b3  c3  NaN  NaN  NaN

#### Funciones de combinacion de DFs: MERGE()


Funcion pd.merche(df1, df2, how=< tipounion >, on/left_on, right_on=< columna/s >)
    
Util para combinar tablas independientes donde los campos de union puedan no tener el mismo nombre, puesto que me permite no solo el ON sino ademas LEFT_ON/RIGHT_ON.

    
Parametros:

* Los dos DFs que se quieren combinar

* how: define el tipo de union.
    
    * inner (interseccion, lo que tienen en comun ambos DFs)
    * outer (todo de ambos DFs y se completa con NaN lo faltante)
    * left (todo lo que esta en el de la izquierda + la interseccion)
    * right (todo lo que esta en el de la derecha + la interseccion)
       
* on: define la/s variable/s de la union. Si son dos o mas se indican como lista. 
* left_on='col_dfA', right_on='col_dfB' :  Si las columnas tienen distinto nombre en cada DF

In [211]:
df1 = pd.DataFrame({'A':['a0','a1','a2','a3'],'B':['b0','b1','b2','b3'],'C':['c0','c1','c2','c3'],'D':['d0','d1','d2','d3']}, index=[0,1,2,3])
df2 = pd.DataFrame({'A':['a4','a5','a6','a7'],'B':['b4','b5','b6','b7'],'C':['c4','c5','c6','c7'],'D':['d4','d5','d6','d7']},index=[4,5,6,7])
df3 = pd.DataFrame({'A':['a8','a9','a10','a11'],'B':['b8','b9','b10','b11'],'C':['c8','c9','c10','c11'],'D':['d8','d9','d10','d11']},index=[8,9,10,11])

df7 = pd.DataFrame({'key':['k0','k1','k2','k3'],'A':['a0','a1','a2','a3'],'B':['b0','b1','b2','b3'],'C':['c0','c1','c2','c3'],'D':['d0','d1','d2','d3']}, index=[4,21,33,5])
df8 = pd.DataFrame({'key':['k0','k1','k2','k3'],'E':['e4','e5','e6','e7'],'F':['f4','f5','f6','f7'],'G':['g4','g5','g6','g7'],'H':['h4','h5','h6','h7']})
df9 = pd.DataFrame({'key1':['k0','k1','k2','k3'],'key2':['k0','k1','k0','k1'],'A':['a0','a1','a2','a3'],'B':['b0','b1','b2','b3'],'C':['c0','c1','c2','c3'],'D':['d0','d1','d2','d3']})
df10 = pd.DataFrame({'key1':['k0','k1','k2','k3'],'key2':['k1','k1','k1','k1'],'E':['e4','e5','e6','e7'],'F':['f4','f5','f6','f7'],'G':['g4','g5','g6','g7'],'H':['h4','h5','h6','h7']})
df11 = pd.DataFrame({'A':['a0','a1','a2','a3'],'B':['b0','b1','b2','b3']}, index=[4,21,31,5])
df12 = pd.DataFrame({'C':['c0','c1','c2','c3'],'D':['d0','d1','d2','d3']}, index=[4,21,33,5])

In [212]:
df7

   key   A   B   C   D
4   k0  a0  b0  c0  d0
21  k1  a1  b1  c1  d1
33  k2  a2  b2  c2  d2
5   k3  a3  b3  c3  d3

In [213]:
df8

  key   E   F   G   H
0  k0  e4  f4  g4  h4
1  k1  e5  f5  g5  h5
2  k2  e6  f6  g6  h6
3  k3  e7  f7  g7  h7

In [214]:
pd.merge(df7,df8, how='inner', on='key')

  key   A   B   C   D   E   F   G   H
0  k0  a0  b0  c0  d0  e4  f4  g4  h4
1  k1  a1  b1  c1  d1  e5  f5  g5  h5
2  k2  a2  b2  c2  d2  e6  f6  g6  h6
3  k3  a3  b3  c3  d3  e7  f7  g7  h7

In [215]:
df9

  key1 key2   A   B   C   D
0   k0   k0  a0  b0  c0  d0
1   k1   k1  a1  b1  c1  d1
2   k2   k0  a2  b2  c2  d2
3   k3   k1  a3  b3  c3  d3

In [216]:
df10

  key1 key2   E   F   G   H
0   k0   k1  e4  f4  g4  h4
1   k1   k1  e5  f5  g5  h5
2   k2   k1  e6  f6  g6  h6
3   k3   k1  e7  f7  g7  h7

In [217]:
pd.merge(df9,df10, how='outer', on=['key1','key2'])

  key1 key2    A    B    C    D    E    F    G    H
0   k0   k0   a0   b0   c0   d0  NaN  NaN  NaN  NaN
1   k1   k1   a1   b1   c1   d1   e5   f5   g5   h5
2   k2   k0   a2   b2   c2   d2  NaN  NaN  NaN  NaN
3   k3   k1   a3   b3   c3   d3   e7   f7   g7   h7
4   k0   k1  NaN  NaN  NaN  NaN   e4   f4   g4   h4
5   k2   k1  NaN  NaN  NaN  NaN   e6   f6   g6   h6

In [218]:
pd.merge(df9,df10, how='inner', on=['key1','key2'])

  key1 key2   A   B   C   D   E   F   G   H
0   k1   k1  a1  b1  c1  d1  e5  f5  g5  h5
1   k3   k1  a3  b3  c3  d3  e7  f7  g7  h7

In [219]:
pd.merge(df9,df10, how='left', on=['key1','key2'])

  key1 key2   A   B   C   D    E    F    G    H
0   k0   k0  a0  b0  c0  d0  NaN  NaN  NaN  NaN
1   k1   k1  a1  b1  c1  d1   e5   f5   g5   h5
2   k2   k0  a2  b2  c2  d2  NaN  NaN  NaN  NaN
3   k3   k1  a3  b3  c3  d3   e7   f7   g7   h7

In [220]:
pd.merge(df9,df10, how='right', on=['key1','key2'])

  key1 key2    A    B    C    D   E   F   G   H
0   k0   k1  NaN  NaN  NaN  NaN  e4  f4  g4  h4
1   k1   k1   a1   b1   c1   d1  e5  f5  g5  h5
2   k2   k1  NaN  NaN  NaN  NaN  e6  f6  g6  h6
3   k3   k1   a3   b3   c3   d3  e7  f7  g7  h7

#### Funciones de combinacion de DFs: JOIN()


Funcion df.join(df, how= < tipounion >)


Util para obtener datos ampliados (variables descriptivas por ej) desde una tabla de detalle, dado que prioriza el df al que se aplica el metodo y no admite on por lo que el campo de union debera tener el mismo nombre en ambas tablas. Esto se da en BD normalizadas.


Es mucho mas eficiente (rapido) que el concat.
Es como un left join. Prima el de la izquierda
        NO adminte ON.

Parametros:

* El df con el que se quiere combinar.

* how: define el tipo de union.
    
    * inner (interseccion, lo que tienen en comun ambos DFs)
    * outer (todo de ambos DFs y se completa con NaN lo faltante)
    * left (todo lo que esta en el de la izquierda + la interseccion)
    * right (todo lo que esta en el de la derecha + la interseccion)

In [221]:
df11

     A   B
4   a0  b0
21  a1  b1
31  a2  b2
5   a3  b3

In [222]:
df12

     C   D
4   c0  d0
21  c1  d1
33  c2  d2
5   c3  d3

In [223]:
df11.join(df12, how='inner')

     A   B   C   D
4   a0  b0  c0  d0
21  a1  b1  c1  d1
5   a3  b3  c3  d3

In [224]:
df11.join(df12, how='outer')

      A    B    C    D
4    a0   b0   c0   d0
5    a3   b3   c3   d3
21   a1   b1   c1   d1
31   a2   b2  NaN  NaN
33  NaN  NaN   c2   d2

In [225]:
df11.join(df12, how='left')

     A   B    C    D
4   a0  b0   c0   d0
21  a1  b1   c1   d1
31  a2  b2  NaN  NaN
5   a3  b3   c3   d3

In [226]:
df11.join(df12, how='right')

      A    B   C   D
4    a0   b0  c0  d0
21   a1   b1  c1  d1
33  NaN  NaN  c2  d2
5    a3   b3  c3  d3

In [227]:
df7

   key   A   B   C   D
4   k0  a0  b0  c0  d0
21  k1  a1  b1  c1  d1
33  k2  a2  b2  c2  d2
5   k3  a3  b3  c3  d3

In [228]:
df8

  key   E   F   G   H
0  k0  e4  f4  g4  h4
1  k1  e5  f5  g5  h5
2  k2  e6  f6  g6  h6
3  k3  e7  f7  g7  h7

In [229]:
# df7.join(df8, how='outer', ) NO ADMITE CAMPOS REPETIDOS

#### Datos Categoricos (es un tipo de dato)

Es necesario importar:  from pandas.api.types import CategoricalDtype 

* DATOS CATEGORICOS SIMPLES

    * La busqueda con datos categoricos es mas rapida con pandas porque estan vectorizados.
    * Ocupan menos memoria.
    * Permite manejar datos categoricos

    * Se construyen:
    
        pd.Series([datos], dtype='category')
    

* DATOS CATEGORICOS ORDINALES (los categoricos que se pueden ordenar)

    .astype(CategoricalDtype(['a','b','c','d'], ordered=True))

Se deben indicar todas las categorias posibles (aunque no esten presentes en el DF) y el orden (de mas prioritario a menos).

In [230]:
from pandas.api.types import CategoricalDtype

Ejemplo categorico normal/simple

In [231]:
frutas=pd.Series(['manzana','pera','platano','ciruela','manzana', 'pera'], dtype='category')

In [232]:
frutas # ya no es object sino category. Observar que se muestran todas las categorias pero SIN orden. El orden es alfa

0    manzana
1       pera
2    platano
3    ciruela
4    manzana
5       pera
dtype: category
Categories (4, object): ['ciruela', 'manzana', 'pera', 'platano']

In [233]:
# Con describe() se muestra la frecuencia de la categoria top que en este caso es manzana

frutas.describe() # muestra 'manzana' como top por orden alfabetico, puesto que 'pera' tambien se repite dos veces

count           6
unique          4
top       manzana
freq            2
dtype: object

Ejemplo categorico ordinal

In [234]:
from pandas.api.types import CategoricalDtype

In [235]:
dfc=pd.DataFrame({'A':['a','b','c','a'],
                    'B':['b','c','c','d']})

In [236]:
dfc

   A  B
0  a  b
1  b  c
2  c  c
3  a  d

In [237]:
dfc.dtypes # son objetos, si quiero que A sea dato categorico

A    object
B    object
dtype: object

In [238]:
dfc['A']=dfc['A'].astype(CategoricalDtype(['a','b','c','d'], ordered=True)) 
# indico todas las categorias posibles y el orden en este caso a,b,c,d pero podria ser otro

In [239]:
dfc.dtypes

A    category
B      object
dtype: object

In [240]:
dfc['A']

0    a
1    b
2    c
3    a
Name: A, dtype: category
Categories (4, object): ['a' < 'b' < 'c' < 'd']

In [241]:
so=pd.Series(['a','b','c','d'], dtype='category') # aqui no esta indicado el orden

In [242]:
so # observar que abajo no indica orden

0    a
1    b
2    c
3    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [243]:
so=so.cat.set_categories(['a', 'b', 'c', 'd'], ordered=True) # aqui indico el orden que es a,b,c,d

In [244]:
so # ya se ve el orden

0    a
1    b
2    c
3    d
dtype: category
Categories (4, object): ['a' < 'b' < 'c' < 'd']

#### Datos faltantes (missings)

* Funciones para hallar nulos: .isna() / .isnull() son equivalentes
* Funcion para hallar datos no nulos: .notna(), .notnull()

Tipos de valores nulos: 

- object -> None
- float64/int64 -> np.nan
- date -> naT

In [425]:
df_m=pd.DataFrame({'A':[1,2,np.nan],
                  'B':['2',None,None],
                  'C':[1.,np.nan,np.nan],
                  'D':[True,False,None]})
df_m

     A     B    C      D
0  1.0     2  1.0   True
1  2.0  None  NaN  False
2  NaN  None  NaN   None

In [426]:
df_m.isna() # Verifica si el valor es nan o null

       A      B      C      D
0  False  False  False  False
1  False   True   True  False
2   True   True   True   True

In [427]:
df_m.isna().sum() # cantidad de nulos por columna

A    1
B    2
C    2
D    1
dtype: int64

In [428]:
df_m.isna().sum().sum() # cantidad de nulos totales de la tabla

6

In [429]:
df_m.isnull() # equvalente a isna()

       A      B      C      D
0  False  False  False  False
1  False   True   True  False
2   True   True   True   True

In [430]:
df_m.isnull().sum() # cant de nulos por columna

A    1
B    2
C    2
D    1
dtype: int64

In [431]:
df_m.isnull().sum().sum() # cant de nulos totales del DF

6

In [432]:
df_m['A'].isnull().any() # en la columna A hay algun null

True

In [433]:
df_m['A'].isnull().all() # en la columna A son nulos todos

False

In [434]:
df_m.isnull().any() # como no se indica columna lo hace para cada columna y en todas hay al menos uno.

A    True
B    True
C    True
D    True
dtype: bool

In [435]:
df_m.isnull().all() # lo mismo pero devuelve verdadero si todas las filas son nulas en cada columna

A    False
B    False
C    False
D    False
dtype: bool

In [436]:
# Sumar valores perdidos. Los muestra por columna.

df_m.isnull().sum()

A    1
B    2
C    2
D    1
dtype: int64

In [437]:
# Si quiero eliminar las filas que tengan algun valor perdido 
df_m.dropna(axis=0) # como no tiene el implace no las borra efectivamente

     A  B    C     D
0  1.0  2  1.0  True

In [438]:
df_m

     A     B    C      D
0  1.0     2  1.0   True
1  2.0  None  NaN  False
2  NaN  None  NaN   None

In [439]:
df_m.dropna(axis=1) # no hay ninguna columna que no tenga faltantes

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [440]:
df_m

     A     B    C      D
0  1.0     2  1.0   True
1  2.0  None  NaN  False
2  NaN  None  NaN   None

In [443]:
df_m.notna()

       A      B      C      D
0   True   True   True   True
1   True  False  False   True
2  False  False  False  False

In [446]:
df_m['B'].notna().sum()

1

In [444]:
df_m.notnull()

       A      B      C      D
0   True   True   True   True
1   True  False  False   True
2  False  False  False  False

In [451]:
df_m['D'].notnull().sum()

2

Otro ejemplo para tratamiento de missings

In [257]:
df_n=pd.DataFrame({'Nombre':['Juan','Lorena','Mercedes','Abigail','Fran','Rodrigo','Lorenzo','Maria','Lucia','Julio'],
                   'Edad':[30,40,50,np.nan,20,15,17,18,np.nan,np.nan],
                   'Sexo':['H','M',None,'M',None,'H','H',None,None,None],
                   'Provincia':['Mu',None,'Ba','Cu','Ja',None,None,'Va',None,'Ca'],
                   'Clase':['A','B','C','D',None,'A','A',None,None,'J']})
df_n

     Nombre  Edad  Sexo Provincia Clase
0      Juan  30.0     H        Mu     A
1    Lorena  40.0     M      None     B
2  Mercedes  50.0  None        Ba     C
3   Abigail   NaN     M        Cu     D
4      Fran  20.0  None        Ja  None
5   Rodrigo  15.0     H      None     A
6   Lorenzo  17.0     H      None     A
7     Maria  18.0  None        Va  None
8     Lucia   NaN  None      None  None
9     Julio   NaN  None        Ca     J

In [258]:
df_n.isna() # Verifica si el valor es nan o null

   Nombre   Edad   Sexo  Provincia  Clase
0   False  False  False      False  False
1   False  False  False       True  False
2   False  False   True      False  False
3   False   True  False      False  False
4   False  False   True      False   True
5   False  False  False       True  False
6   False  False  False       True  False
7   False  False   True      False   True
8   False   True   True       True   True
9   False   True   True      False  False

In [259]:
df_n

     Nombre  Edad  Sexo Provincia Clase
0      Juan  30.0     H        Mu     A
1    Lorena  40.0     M      None     B
2  Mercedes  50.0  None        Ba     C
3   Abigail   NaN     M        Cu     D
4      Fran  20.0  None        Ja  None
5   Rodrigo  15.0     H      None     A
6   Lorenzo  17.0     H      None     A
7     Maria  18.0  None        Va  None
8     Lucia   NaN  None      None  None
9     Julio   NaN  None        Ca     J

In [260]:
# Como eliminar aquellas filas con dos o mas datos faltantes

In [261]:
df_n.dropna(thresh=4) # thresh = n donde n es el numero de campos con datos (n o mas datos validos) 
# Los que tengan menos de 4 campos con datos se eliminaran
# Se quedaran las filas que tengan al menos 4 campos con datos.

     Nombre  Edad  Sexo Provincia Clase
0      Juan  30.0     H        Mu     A
1    Lorena  40.0     M      None     B
2  Mercedes  50.0  None        Ba     C
3   Abigail   NaN     M        Cu     D
5   Rodrigo  15.0     H      None     A
6   Lorenzo  17.0     H      None     A

In [262]:
df_n['Edad'].mean()

27.142857142857142

In [263]:
# cambio las edad=none y pongo la media
df_n['Edad'].fillna(value=df_n['Edad'].mean()) # no pone inplace=True con lo cual no se ha cambiado

0    30.000000
1    40.000000
2    50.000000
3    27.142857
4    20.000000
5    15.000000
6    17.000000
7    18.000000
8    27.142857
9    27.142857
Name: Edad, dtype: float64

In [264]:
df_n

     Nombre  Edad  Sexo Provincia Clase
0      Juan  30.0     H        Mu     A
1    Lorena  40.0     M      None     B
2  Mercedes  50.0  None        Ba     C
3   Abigail   NaN     M        Cu     D
4      Fran  20.0  None        Ja  None
5   Rodrigo  15.0     H      None     A
6   Lorenzo  17.0     H      None     A
7     Maria  18.0  None        Va  None
8     Lucia   NaN  None      None  None
9     Julio   NaN  None        Ca     J

#### Criterios a la hora de eliminar datos faltantes:

Se analizan las columnas que interesen para el analisis.

* Datos numericos: 
    * Completar con media, mediana 
    * Recosntruccion del dato por algoritmo Knn 

* Datos cualitativos:
    * si <5% de los registros son misssing en la variable, se elimina la fila completa.
    * si missing > 5% y < 60% se aplica algoritmo para obtener el dato faltante.
    * si missing >= 60% de los registros, se borra la variable o se intenta reconstruir, pero con cuidado porque al reconstruir nos podemos inventar demasiado el dato. En gral se borra la columna.

#### Obtencion de datos unicos. Funcion unique()

df_n['Sexo'].unique() # valores distintos en Sexo

In [266]:
df_n['Sexo'].nunique() # Numero de valores unicos (el null no se cuenta)

2

In [267]:
df_n.duplicated() # filas repetidas. Encuentra por filas la existencia de tuplas repetidas

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [268]:
df_n.duplicated().sum() # filas repetidas. Cuentas las filas repetidas

0

In [269]:
# Se puede valorar sobre una o un conjunto de variables
df_n['Clase'].duplicated().sum() # Considera nulos

4

In [270]:
# Se puede valorar sobre una o un conjunto de variables
df_n['Edad'].duplicated()#.sum() #  considera nulos

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8     True
9     True
Name: Edad, dtype: bool

In [271]:
df_n.drop_duplicates() # con inplace = True elimino efectivamente

     Nombre  Edad  Sexo Provincia Clase
0      Juan  30.0     H        Mu     A
1    Lorena  40.0     M      None     B
2  Mercedes  50.0  None        Ba     C
3   Abigail   NaN     M        Cu     D
4      Fran  20.0  None        Ja  None
5   Rodrigo  15.0     H      None     A
6   Lorenzo  17.0     H      None     A
7     Maria  18.0  None        Va  None
8     Lucia   NaN  None      None  None
9     Julio   NaN  None        Ca     J

In [273]:
#df.drop_duplicates(['DNI']) # borra los duplicados por determinada variable (por ejemplo un identificador unico como DNI)

#### Datos Fuera de Rango (outliers) y Valores Anormales.

Datos fuera de rango o atipicos son los que tienen un valor distinto a la moda ¿? y al rango normal presente en la variable. 

* Calculo de datos fuera de rango valido:

    * out_low: abs(q1-1.5*RI) Lo que esta por debajo de este. 
    * out_hig: abs(q3+1.5*RI) Lo que esta por encima de este.
    
    RI rango intercuartilico (q3-q1)
    
    NOTA: En dispersiones muy altas se puede considear 2.5 o hasta 3 como coheficiente.

In [274]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [275]:
titanic.describe()  # La mediana es la del percentil 50%

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [276]:
titanic.shape

(891, 15)

In [277]:
titanic.size

13365

In [278]:
# Los datos a eliminar del df titanic por edad fuera de rango.

out_low=abs(20.125-(1.5*(38-20.125)))
out_hig=abs(38+(1.5*(38-20.125)))
out_low,out_hig

(6.6875, 64.8125)

* Obtener el IRQ (RIC rango intercuartilico)

In [279]:
RI_titanic=titanic.age.quantile([.75])[0.75]-titanic.age.quantile([.25])[0.25]
RI_titanic

17.875

In [280]:
RI_titanic=titanic['age'].quantile([.75])[0.75]-titanic['age'].quantile([.25])[0.25]
RI_titanic

17.875

* Obterner los umbrales inferior y superior

In [82]:
q1=titanic['age'].quantile([.25])[0.25]
q2=titanic['age'].quantile([.5])[0.5] # la media y la mediana son iguales si la distribucion es normal
q3=titanic['age'].quantile([.75])[0.75]
irq=q3-q1


out_low=abs(q1-1.5*irq)
out_hig=abs(q3+1.5*irq)

q1,q3,irq,out_low,out_hig

(20.125, 38.0, 17.875, 6.6875, 64.8125)

NOTA: Si la distribucion es normal, la media y la mediana son iguales.
    Que la media y la mediana sean iguales no quiere decir que la distribucion sea normal. No se puede asumir.

In [282]:
titanic.age.quantile([.25])[0.25]

20.125

In [283]:

titanic.groupby(by='class').count()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,who,adult_male,deck,embark_town,alive,alone
class,,,,,,,,,,,,,,
First,216,216,216,186,216,216,216,214,216,216,175,214,216,216
Second,184,184,184,173,184,184,184,184,184,184,16,184,184,184
Third,491,491,491,355,491,491,491,491,491,491,12,491,491,491

In [70]:
titanic[titanic['age']<6.7].count()['survived'] # 47

47

In [71]:
titanic[titanic['age']>64.8].count()['survived'] # 11

11

In [286]:
titanic_atipicos=pd.concat([titanic[titanic['age']<6.69],titanic[titanic['age']>64.8]], axis=0)

In [85]:
 titanic[(titanic['age']>=6.69) & (titanic['age']<=64.8)].shape # da ambiguo ## Creo que no es correcto

(656, 15)

In [80]:
titanic.shape

(891, 15)

In [288]:
titanic_atipicos.shape # 47+11 ok

(58, 15)

In [289]:
len(titanic_atipicos), titanic_atipicos['age'].count()

(58, 58)

OUTLIERS si superan el 5% como en este caso se puede:

* imputar a missing
* los quitamos y volvemos a calcular
* subimos el coeficiente a algo mayor a 1.5

In [290]:
def porcentaje_outliers(df: pd.DataFrame, out_l: float, out_h: float, x: str) -> float:
    """
    Uso: calcula el porcentaje de outliers sobre la variable x, considerando las cotas minima(out_l) y maxima(out_h), en el total del DF.

    Args:
        df[dataframe]: DataFrame a analizar.
        out_l[int]: cota inferior outliers (Q1-1.5*RI)
        out_h[int]: cot superior outliers (Q3+1.5*RI).
        x[str]:variable objetivo a la cual se le analizan sus datos atipicos.
    

    Returns:
        porcentaje[]:porcentaje de outliers sobre el total.
    """
    return 100*(pd.concat([df[df[str(x)]<abs(out_l)],df[df[str(x)]>abs(out_h)]],axis=0)).shape[0]/df[str(x)].shape[0]

df=sns.load_dataset('titanic')
print('El porcentaje de filas a descartar es', round(porcentaje_outliers(df,6.6875,64.8,'age'),2))

El porcentaje de filas a descartar es 6.51

In [291]:
print(porcentaje_outliers.__annotations__)

{'df': <class 'pandas.core.frame.DataFrame'>, 'out_l': <class 'float'>, 'out_h': <class 'float'>, 'x': <class 'str'>, 'return': <class 'float'>}

In [292]:
print(help(porcentaje_outliers))

Help on function porcentaje_outliers in module __main__:

porcentaje_outliers(df: pandas.core.frame.DataFrame, out_l: float, out_h: float, x: str) -> float
    Uso: calcula el porcentaje de outliers sobre la variable x, considerando las cotas minima(out_l) y maxima(out_h), en el total del DF.

    Args:
        df[dataframe]: DataFrame a analizar.
        out_l[int]: cota inferior outliers (Q1-1.5*RI)
        out_h[int]: cot superior outliers (Q3+1.5*RI).
        x[str]:variable objetivo a la cual se le analizan sus datos atipicos.


    Returns:
        porcentaje[]:porcentaje de outliers sobre el total.

None

In [83]:
titanic_atipicos=pd.concat([titanic[titanic['age']<out_low],titanic[titanic['age']>out_hig]], axis=0)
titanic_atipicos.shape[0]

58

In [294]:
titanic[(titanic['age']<out_low) | (titanic['age']>out_hig)].shape

(58, 15)

In [295]:
titanic[(titanic["age"]>out_low) & (titanic["age"]<out_hig)].shape

(656, 15)

In [296]:
titanic.where((titanic['age']>out_low) & (titanic['age']<out_hig)).count()['survived']

656

In [297]:
titanic.shape

(891, 15)

In [298]:
titanic.drop(titanic[(titanic['age']<out_low) | (titanic['age']>out_hig)].index).shape # 891-58=833 ok

(833, 15)

#### Tablas de contingencia o tablas de cruce o tablas cruzadas (pivot table)

* funcion: pd.crosstab()

Parametros:

    * variable1
    * variable2
    * margins=True (si queremos los subtotales y total general)

Es una pivot table con los subtotales y total general de una variable numerica.

Es util para analizar variables categoricas para evaluar una variable cuantitativa.

Ejercicio:

* ¿ Donde hay mas veteranos en la marina o en infanteria? Hay los mismos en c/u.
* ¿ De donde proceden matoritariamente los junior en el ejercito? Estan repartidos tanto en compania como en regimientos.

In [299]:
df=pd.DataFrame({'regimiento': ['El Freno', 'El Freno', 'El Freno', 'El Freno', 'El Osado', 'El Osado', 'El Osado', 'El Osado', 'El Distinguido', 'El Distinguido', 'El Distinguido', 'El Distinguido'], 
                 'compania': ['infanteria', 'infanteria', 'marina', 'marina', 'infanteria', 'infanteria', 'marina', 'marina','infanteria', 'infanteria', 'marina', 'marina'], 
                 'experiencia': ['veterano', 'junior', 'veterano', 'junior', 'veterano', 'junior', 'veterano', 'junior','veterano', 'junior', 'veterano', 'junior'],
                 'nombre': ['Jose', 'Jorge', 'Mercedes', 'Jose', 'Carolina', 'Julio', 'Ruben', 'Sara', 'Sergio', 'Pablo', 'Rodrigo', 'Mercedes'], 
                 'puntuacionPistola': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
                 'puntuacionFusil': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]})
df

,regimiento,compania,experiencia,nombre,puntuacionPistola,puntuacionFusil
0,El Freno,infanteria,veterano,Jose,4,25
1,El Freno,infanteria,junior,Jorge,24,94
2,El Freno,marina,veterano,Mercedes,31,57
3,El Freno,marina,junior,Jose,2,62
4,El Osado,infanteria,veterano,Carolina,3,70
5,El Osado,infanteria,junior,Julio,4,25
6,El Osado,marina,veterano,Ruben,24,94
7,El Osado,marina,junior,Sara,31,57
8,El Distinguido,infanteria,veterano,Sergio,2,62
9,El Distinguido,infanteria,junior,Pablo,3,70
10,El Distinguido,marina,veterano,Rodrigo,2,62
11,El Distinguido,marina,junior,Mercedes,3,70

In [300]:
pd.crosstab(df['experiencia'], df['compania'], margins=True) # experiencia en vertical y copañia horizontal

compania     infanteria  marina  All
experiencia
junior                3       3    6
veterano              3       3    6
All                   6       6   12

In [301]:
pd.crosstab([df['compania'], df['experiencia']], df['regimiento'] , margins=False)

regimiento              El Distinguido  El Freno  El Osado
compania   experiencia
infanteria junior                    1         1         1
           veterano                  1         1         1
marina     junior                    1         1         1
           veterano                  1         1         1

Ejercicio FFAA: Dado el siguiente DF

In [302]:
import pandas as pd

In [303]:
df=pd.DataFrame({'regimiento': ['El Freno', 'El Freno', 'El Freno', 'El Freno', 'El Osado', 'El Osado', 'El Osado', 'El Osado', 'El Distinguido', 'El Distinguido', 'El Distinguido', 'El Distinguido'],
                 'compania': ['infanteria', 'infanteria', 'marina', 'marina', 'infanteria', 'infanteria', 'marina', 'marina','infanteria', 'infanteria', 'marina', 'marina'],
                 'experiencia': ['veterano', 'junior', 'veterano', 'junior', 'veterano', 'junior', 'veterano', 'junior','veterano', 'junior', 'veterano', 'junior'],
                 'nombre': ['Jose', 'Jorge', 'Mercedes', 'Jose', 'Carolina', 'Julio', 'Ruben', 'Sara', 'Sergio', 'Pablo', 'Rodrigo', 'Mercedes'],
                 'puntuacionPistola': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
                 'puntuacionFusil': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]})

In [304]:
df

,regimiento,compania,experiencia,nombre,puntuacionPistola,puntuacionFusil
0,El Freno,infanteria,veterano,Jose,4,25
1,El Freno,infanteria,junior,Jorge,24,94
2,El Freno,marina,veterano,Mercedes,31,57
3,El Freno,marina,junior,Jose,2,62
4,El Osado,infanteria,veterano,Carolina,3,70
5,El Osado,infanteria,junior,Julio,4,25
6,El Osado,marina,veterano,Ruben,24,94
7,El Osado,marina,junior,Sara,31,57
8,El Distinguido,infanteria,veterano,Sergio,2,62
9,El Distinguido,infanteria,junior,Pablo,3,70
10,El Distinguido,marina,veterano,Rodrigo,2,62
11,El Distinguido,marina,junior,Mercedes,3,70

Agregar la siguiente informacion

puntuacionPistolaCategorico:
    [0 - 20] malo
    [21 - 50] bueno
    [51 -75] muy bueno
    [76-100] Excelente
    
puntuacionFusilCategorico:
    [0 - 25] malo
    [26 - 50] bueno
    [51 -75] muy bueno
    [76-100] Excelente

In [305]:
# Solucion 1 (solucion mala)

## Esta solucion no es la mas idonea. Como se ve tira muchos warnings

df['puntuacionPistolaCategorico']='Malo'
df['puntuacionPistolaCategorico'][(df['puntuacionPistola']>20) & (df['puntuacionPistola']<=50)]='bueno'
df['puntuacionPistolaCategorico'][(df['puntuacionPistola']>50) & (df['puntuacionPistola']<=75)]='muy bueno'
df['puntuacionPistolaCategorico'][(df['puntuacionPistola']>75) & (df['puntuacionPistola']<=100)]='excelente'

# Solucion 1 (solucion mala)

df['puntuacionFusilCategorico']='Malo'


df['puntuacionFusilCategorico'][(df['puntuacionFusil']>25) & (df['puntuacionFusil']<=50)]='bueno'
df['puntuacionFusilCategorico'][(df['puntuacionFusil']>50) & (df['puntuacionFusil']<=75)]='muy bueno'
df['puntuacionFusilCategorico'][(df['puntuacionFusil']>75) & (df['puntuacionFusil']<=100)]='excelente'

C:\Users\carolina\AppData\Local\Temp\ipykernel_6076\2291495284.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['puntuacionPistolaCategorico'][(df['puntuacionPistola']>20) & (df['puntuacionPistola']<=50)]='bueno'
C:\Users\carolina\AppData\Local\Temp\ipykernel_6076\2291495284.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['puntuacionPistolaCategorico'][(df['puntuacionPistola']>50) & (df['puntuacionPistola']<=75)]='muy bueno'
C:\Users\carolina\AppData\Local\Temp\ipykernel_6076\2291495284.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['puntuacionPistolaCategorico'][(df['puntuacionPistola']>75) & (df['puntuacionPistola']<=100)]='excelente'
C:\Users\carolina\AppData\Local\Temp\ipykernel_6076\2291495284.py:15: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['puntuacionFusilCategorico'][(df['puntuacionFusil']>25) & (df['puntuacionFusil']<=50)]='bueno'
C:\Users\carolina\AppData\Local\Temp\ipykernel_6076\2291495284.py:16: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['puntuacionFusilCategorico'][(df['puntuacionFusil']>50) & (df['puntuacionFusil']<=75)]='muy bueno'
C:\Users\carolina\AppData\Local\Temp\ipykernel_6076\2291495284.py:17: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['puntuacionFusilCategorico'][(df['puntuacionFusil']>75) & (df['puntuacionFusil']<=100)]='excelente'

In [306]:
df

,regimiento,compania,experiencia,nombre,puntuacionPistola,puntuacionFusil,puntuacionPistolaCategorico,puntuacionFusilCategorico
0,El Freno,infanteria,veterano,Jose,4,25,Malo,Malo
1,El Freno,infanteria,junior,Jorge,24,94,bueno,excelente
2,El Freno,marina,veterano,Mercedes,31,57,bueno,muy bueno
3,El Freno,marina,junior,Jose,2,62,Malo,muy bueno
4,El Osado,infanteria,veterano,Carolina,3,70,Malo,muy bueno
5,El Osado,infanteria,junior,Julio,4,25,Malo,Malo
6,El Osado,marina,veterano,Ruben,24,94,bueno,excelente
7,El Osado,marina,junior,Sara,31,57,bueno,muy bueno
8,El Distinguido,infanteria,veterano,Sergio,2,62,Malo,muy bueno
9,El Distinguido,infanteria,junior,Pablo,3,70,Malo,muy bueno
10,El Distinguido,marina,veterano,Rodrigo,2,62,Malo,muy bueno
11,El Distinguido,marina,junior,Mercedes,3,70,Malo,muy bueno

In [307]:
df['puntuacionPistolaCategorico']=''
df['puntuacionFusilCategorico']=''
df

,regimiento,compania,experiencia,nombre,puntuacionPistola,puntuacionFusil,puntuacionPistolaCategorico,puntuacionFusilCategorico
0,El Freno,infanteria,veterano,Jose,4,25,,
1,El Freno,infanteria,junior,Jorge,24,94,,
2,El Freno,marina,veterano,Mercedes,31,57,,
3,El Freno,marina,junior,Jose,2,62,,
4,El Osado,infanteria,veterano,Carolina,3,70,,
5,El Osado,infanteria,junior,Julio,4,25,,
6,El Osado,marina,veterano,Ruben,24,94,,
7,El Osado,marina,junior,Sara,31,57,,
8,El Distinguido,infanteria,veterano,Sergio,2,62,,
9,El Distinguido,infanteria,junior,Pablo,3,70,,
10,El Distinguido,marina,veterano,Rodrigo,2,62,,
11,El Distinguido,marina,junior,Mercedes,3,70,,

In [308]:
# Solucion 2 (algo mejor, al menos utiliza loc que es mas rapido)

#pistola
df.loc[df['puntuacionPistola']<=20, 'puntuacionPistolaCategorico']='malo'
df.loc[(df['puntuacionPistola']>20) & (df['puntuacionPistola']<=50), 'puntuacionPistolaCategorico']='bueno'
df.loc[(df['puntuacionPistola']>50) & (df['puntuacionPistola']<=75), 'puntuacionPistolaCategorico']='muy bueno'
df.loc[(df['puntuacionPistola']>75) & (df['puntuacionPistola']<=100), 'puntuacionPistolaCategorico']='excelente'

#fusil
df.loc[df['puntuacionFusil']<=25, 'puntuacionFusilCategorico']='malo'
df.loc[(df['puntuacionFusil']>25) & (df['puntuacionFusil']<=50), 'puntuacionFusilCategorico']='bueno'
df.loc[(df['puntuacionFusil']>50) & (df['puntuacionFusil']<=75), 'puntuacionFusilCategorico']='muy bueno'
df.loc[(df['puntuacionFusil']>75) & (df['puntuacionFusil']<=100), 'puntuacionFusilCategorico']='excelente'

In [309]:
df

,regimiento,compania,experiencia,nombre,puntuacionPistola,puntuacionFusil,puntuacionPistolaCategorico,puntuacionFusilCategorico
0,El Freno,infanteria,veterano,Jose,4,25,malo,malo
1,El Freno,infanteria,junior,Jorge,24,94,bueno,excelente
2,El Freno,marina,veterano,Mercedes,31,57,bueno,muy bueno
3,El Freno,marina,junior,Jose,2,62,malo,muy bueno
4,El Osado,infanteria,veterano,Carolina,3,70,malo,muy bueno
5,El Osado,infanteria,junior,Julio,4,25,malo,malo
6,El Osado,marina,veterano,Ruben,24,94,bueno,excelente
7,El Osado,marina,junior,Sara,31,57,bueno,muy bueno
8,El Distinguido,infanteria,veterano,Sergio,2,62,malo,muy bueno
9,El Distinguido,infanteria,junior,Pablo,3,70,malo,muy bueno
10,El Distinguido,marina,veterano,Rodrigo,2,62,malo,muy bueno
11,El Distinguido,marina,junior,Mercedes,3,70,malo,muy bueno

In [310]:
df['puntuacionPistolaCategorico']=''
df['puntuacionFusilCategorico']=''
df

,regimiento,compania,experiencia,nombre,puntuacionPistola,puntuacionFusil,puntuacionPistolaCategorico,puntuacionFusilCategorico
0,El Freno,infanteria,veterano,Jose,4,25,,
1,El Freno,infanteria,junior,Jorge,24,94,,
2,El Freno,marina,veterano,Mercedes,31,57,,
3,El Freno,marina,junior,Jose,2,62,,
4,El Osado,infanteria,veterano,Carolina,3,70,,
5,El Osado,infanteria,junior,Julio,4,25,,
6,El Osado,marina,veterano,Ruben,24,94,,
7,El Osado,marina,junior,Sara,31,57,,
8,El Distinguido,infanteria,veterano,Sergio,2,62,,
9,El Distinguido,infanteria,junior,Pablo,3,70,,
10,El Distinguido,marina,veterano,Rodrigo,2,62,,
11,El Distinguido,marina,junior,Mercedes,3,70,,

In [311]:
# Solucion 3 ( esta solucion es buena)

def cPist(v):
	if v < 20:
		y='malo'
	elif v<=50:
		y='bueno'
	elif v<=75:
		y='muy bueno'
	else:
		y='excelente'
	return y


def cFus(v):
	if v < 25:
		y='malo'
	elif v<=50:
		y='bueno'
	elif v<=75:
		y='muy bueno'
	else:
		y='excelente'
	return y

df['puntuacionPistolaCategorico']=df['puntuacionPistola'].apply(cPist)
df['puntuacionFusilCategorico']=df['puntuacionFusil'].apply(cFus)

In [312]:
df

,regimiento,compania,experiencia,nombre,puntuacionPistola,puntuacionFusil,puntuacionPistolaCategorico,puntuacionFusilCategorico
0,El Freno,infanteria,veterano,Jose,4,25,malo,bueno
1,El Freno,infanteria,junior,Jorge,24,94,bueno,excelente
2,El Freno,marina,veterano,Mercedes,31,57,bueno,muy bueno
3,El Freno,marina,junior,Jose,2,62,malo,muy bueno
4,El Osado,infanteria,veterano,Carolina,3,70,malo,muy bueno
5,El Osado,infanteria,junior,Julio,4,25,malo,bueno
6,El Osado,marina,veterano,Ruben,24,94,bueno,excelente
7,El Osado,marina,junior,Sara,31,57,bueno,muy bueno
8,El Distinguido,infanteria,veterano,Sergio,2,62,malo,muy bueno
9,El Distinguido,infanteria,junior,Pablo,3,70,malo,muy bueno
10,El Distinguido,marina,veterano,Rodrigo,2,62,malo,muy bueno
11,El Distinguido,marina,junior,Mercedes,3,70,malo,muy bueno

##### Funcion pd.cut() Para Crear variables categoricas a partir de variables numericas

In [313]:
# Solucion 4 (la mejor)



df['puntuacionPistolaCategorico']=pd.cut(x=df['puntuacionPistola'], bins=[0,20,50,75,100], labels = ['malo','bueno','muy bueno','excelente'])
# el 20 va incluido en 'malo' 
df['puntuacionFusilCategorico']=pd.cut(x=df['puntuacionFusil'], bins=[0,25,50,75,100], labels = ['malo','bueno','muy bueno','excelente'])
df

,regimiento,compania,experiencia,nombre,puntuacionPistola,puntuacionFusil,puntuacionPistolaCategorico,puntuacionFusilCategorico
0,El Freno,infanteria,veterano,Jose,4,25,malo,malo
1,El Freno,infanteria,junior,Jorge,24,94,bueno,excelente
2,El Freno,marina,veterano,Mercedes,31,57,bueno,muy bueno
3,El Freno,marina,junior,Jose,2,62,malo,muy bueno
4,El Osado,infanteria,veterano,Carolina,3,70,malo,muy bueno
5,El Osado,infanteria,junior,Julio,4,25,malo,malo
6,El Osado,marina,veterano,Ruben,24,94,bueno,excelente
7,El Osado,marina,junior,Sara,31,57,bueno,muy bueno
8,El Distinguido,infanteria,veterano,Sergio,2,62,malo,muy bueno
9,El Distinguido,infanteria,junior,Pablo,3,70,malo,muy bueno
10,El Distinguido,marina,veterano,Rodrigo,2,62,malo,muy bueno
11,El Distinguido,marina,junior,Mercedes,3,70,malo,muy bueno

Ejercicio FFAA: ¿Donde hay mas tiradores buenos en funcion de su experiencia? ¿Y si lo cruzaramos con su compania, cual es la conclusion que podriamos sacar?

In [314]:
# Por experiencia

In [315]:
pd.crosstab( df['experiencia'], df['puntuacionPistolaCategorico']   , margins=True)

puntuacionPistolaCategorico  malo  bueno  All
experiencia
junior                          4      2    6
veterano                        4      2    6
All                             8      4   12

Con pistola son igualmente malos tanto el grupo junior como el veterano.

In [316]:
pd.crosstab( df['experiencia'], df['puntuacionFusilCategorico']   , margins=True)

puntuacionFusilCategorico  malo  muy bueno  excelente  All
experiencia
junior                        1          4          1    6
veterano                      1          4          1    6
All                           2          8          2   12

Tampoco hay diferencias en cuanto a la experiencia con el fusil. Hay tantos malos como buenos y excelentes en ambos perfiles de experiencia.

In [317]:
# Por compania

In [318]:
pd.crosstab( [df['compania'], df['experiencia']], df['puntuacionPistolaCategorico']   , margins=True)

puntuacionPistolaCategorico  malo  bueno  All
compania   experiencia
infanteria junior               2      1    3
           veterano             3      0    3
marina     junior               2      1    3
           veterano             1      2    3
All                             8      4   12

In [319]:
pd.crosstab( [df['compania'], df['experiencia']], df['puntuacionFusilCategorico']   , margins=True)

puntuacionFusilCategorico  malo  muy bueno  excelente  All
compania   experiencia
infanteria junior             1          1          1    3
           veterano           1          2          0    3
marina     junior             0          3          0    3
           veterano           0          2          1    3
All                           2          8          2   12

In [320]:
# Con pistola en Marina suelen ser mas buenos que en infanteria.
# Con fusil, son mas buenos que malos. Hay mas buenos en marina que en infanteria.

# Gente mala con fusil hay mas en infanteria.
# Seria mejor coger gente de marina que de infanteria.

#### Mas funciones estadisticas

In [321]:
historico_stock

      adidas  newbalance  puma  rebook
2009       0          10    30     200
2010       5          20   100      10
2011      15          33    67      19
2012      35          27    77      10
2013      21          19    80      20
2014      15          25   120      29
2015      26          40    92      19
2016       8          52    91      41
2017      10          35    15       9
2018      11          33    23      11
2019      20          35    41      19
2020      30          12    35      20
2021      40          60    69      19
2022     100          33    60      30

In [322]:
historico_stock.mean(axis=0) # Media aritmetica por filas. Adidas y demas marcas son variables (columnas)

adidas        24.000000
newbalance    31.000000
puma          64.285714
rebook        32.571429
dtype: float64

In [323]:
historico_stock.mean(axis=1) # Media aritmetica por columnas. 
# Los indices de fila representan los años. La media es de todas las marcas para cada año.

2009    60.00
2010    33.75
2011    33.50
2012    37.25
2013    35.00
2014    47.25
2015    44.25
2016    48.00
2017    17.25
2018    19.50
2019    28.75
2020    24.25
2021    47.00
2022    55.75
dtype: float64

In [324]:
historico_stock.median(axis=0) # Mediana

adidas        17.5
newbalance    33.0
puma          68.0
rebook        19.0
dtype: float64

In [325]:
historico_stock.median(axis=1)

2009    20.0
2010    15.0
2011    26.0
2012    31.0
2013    20.5
2014    27.0
2015    33.0
2016    46.5
2017    12.5
2018    17.0
2019    27.5
2020    25.0
2021    50.0
2022    46.5
dtype: float64

In [326]:
historico_stock.max(axis=0)

adidas        100
newbalance     60
puma          120
rebook        200
dtype: int64

In [327]:
historico_stock.max(axis=1)

2009    200
2010    100
2011     67
2012     77
2013     80
2014    120
2015     92
2016     91
2017     35
2018     33
2019     41
2020     35
2021     69
2022    100
dtype: int64

In [328]:
historico_stock.min(axis=0)

adidas         0
newbalance    10
puma          15
rebook         9
dtype: int64

In [329]:
historico_stock.mode(axis=0)   # la moda Con estos datos no tiene sentido porq no hay repetociones.

    adidas  newbalance  puma  rebook
0     15.0        33.0    15    19.0
1      NaN         NaN    23     NaN
2      NaN         NaN    30     NaN
3      NaN         NaN    35     NaN
4      NaN         NaN    41     NaN
5      NaN         NaN    60     NaN
6      NaN         NaN    67     NaN
7      NaN         NaN    69     NaN
8      NaN         NaN    77     NaN
9      NaN         NaN    80     NaN
10     NaN         NaN    91     NaN
11     NaN         NaN    92     NaN
12     NaN         NaN   100     NaN
13     NaN         NaN   120     NaN

In [330]:
historico_stock.mode(axis=1) # esto tendria sentido si en las filas tenemos arrays en las variables entonce nos calcularia la moda dentro del array.

         0     1     2      3
2009   0.0  10.0  30.0  200.0
2010   5.0  10.0  20.0  100.0
2011  15.0  19.0  33.0   67.0
2012  10.0  27.0  35.0   77.0
2013  19.0  20.0  21.0   80.0
2014  15.0  25.0  29.0  120.0
2015  19.0  26.0  40.0   92.0
2016   8.0  41.0  52.0   91.0
2017   9.0  10.0  15.0   35.0
2018  11.0   NaN   NaN    NaN
2019  19.0  20.0  35.0   41.0
2020  12.0  20.0  30.0   35.0
2021  19.0  40.0  60.0   69.0
2022  30.0  33.0  60.0  100.0

In [331]:
historico_stock

      adidas  newbalance  puma  rebook
2009       0          10    30     200
2010       5          20   100      10
2011      15          33    67      19
2012      35          27    77      10
2013      21          19    80      20
2014      15          25   120      29
2015      26          40    92      19
2016       8          52    91      41
2017      10          35    15       9
2018      11          33    23      11
2019      20          35    41      19
2020      30          12    35      20
2021      40          60    69      19
2022     100          33    60      30

In [332]:
historico_stock['adidas'].mode()
# aqui se ve algo puesto que en adidas si que se repite el 15

0    15
Name: adidas, dtype: int64

In [333]:
historico_stock['newbalance'].mode()

0    33
Name: newbalance, dtype: int64

In [334]:
historico_stock.quantile([0,.25,.50,.75,1]) # Percentiles

      adidas  newbalance    puma  rebook
0.00    0.00       10.00   15.00    9.00
0.25   10.25       21.25   36.50   13.00
0.50   17.50       33.00   68.00   19.00
0.75   29.00       35.00   88.25   26.75
1.00  100.00       60.00  120.00  200.00

In [335]:
historico_stock.quantile([0,.25,.50,.75,1], axis=1)

,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019,2020,2021,2022
0.00,0.0,5.00,15.0,10.00,19.00,15.00,19.00,8.00,9.00,11.0,19.00,12.00,19.00,30.00
0.25,7.5,8.75,18.0,22.75,19.75,22.50,24.25,32.75,9.75,11.0,19.75,18.00,34.75,32.25
0.50,20.0,15.00,26.0,31.00,20.50,27.00,33.00,46.50,12.50,17.0,27.50,25.00,50.00,46.50
0.75,72.5,40.00,41.5,45.50,35.75,51.75,53.00,61.75,20.00,25.5,36.50,31.25,62.25,70.00
1.00,200.0,100.00,67.0,77.00,80.00,120.00,92.00,91.00,35.00,33.0,41.00,35.00,69.00,100.00

In [336]:
historico_stock.var(axis=0)   # varianza

adidas         610.615385
newbalance     194.307692
puma          1002.065934
rebook        2401.186813
dtype: float64

In [337]:
historico_stock.std(axis=0) # representa cuan dispersos estan los valores de su media 
# Es la raiz cuadrada de la varianza

adidas        24.710633
newbalance    13.939429
puma          31.655425
rebook        49.001906
dtype: float64

##### Correlacion

* Coeficiente de Pearson determina el grado de relacion o dependencia LINEAL de una variable CUANTITATIVA respecto de otra.

Los valores del coeficiente de Pearson indican:

    * 0 a 0.3 son variables de correlacion lineal debil o inexistente
    * 0.3 a 0.5 correlacion media
    * 0.5 a 1 alta

In [338]:
def coefPearson(DF):
	return abs(DF.std()/DF.mean())

coefPearson(historico_stock)

adidas        1.029610
newbalance    0.449659
puma          0.492418
rebook        1.504444
dtype: float64

##### Asimetria de las variables

* Funcion skew() asimetria segun Fisher.

El valor de skew indica la simetria de la distribuicion de una variable respecto a la media aritmetica sin necesidad de graficar.

Los rangos y significado de su resultado son:

    * Asimetria a derecha o positiva (+): de 0,5 a 1 o inf 
    * Asimetria a izquierda o negativa (-): de -inf o -1 a -0,5 
    * Simetrica de -0,5 a 0,5 (simetria perfecta = 0)

In [339]:
historico_stock.skew() # da la asimetria de las variables

adidas        2.458545
newbalance    0.499389
puma         -0.009359
rebook        3.534320
dtype: float64

##### Curtosis de las variables

El valor de la curtosis (K) determina el grado de concentracion de los valores de una variable en la region central de la distribucion. Como se presentan los datos en relacion a su media.

El significado de su resultado es:

    * Leptocurtica > 3 (diagramas con curva alta y estrecha) Los valores estan proximos a la media.
    * Mesocurtica = 3 (curva de altura media) Campana de Gauss cercano a 0 o 0.
    * Platicurtica <3 (diagrama con curva baja y ancha) Los datos estan dispersos respecto a su media.

In [340]:
historico_stock.kurtosis()

adidas         7.335589
newbalance     0.277559
puma          -0.956566
rebook        12.864247
dtype: float64

https://economipedia.com/definiciones/curtosis.html

#### Covarianza: una variable explica a otra. 

La covarianza es baja cuando son proximos los valores.

En el ejemplo si:

* a.cov(b) = 0,85
* b.cov(a) = 0,96

Me quedo con b.

In [342]:
a=pd.Series(data=historico_stock['adidas'], index=historico_stock.index)
b=pd.Series(data=historico_stock['puma'], index=historico_stock.index)
a.cov(b) # con python

17.923076923076927

In [343]:
np.cov(a,b) # con numpy

array([[ 610.61538462,   17.92307692],
       [  17.92307692, 1002.06593407]])

In [344]:
# covarianza en dataframe
historico_stock.cov()

                adidas  newbalance         puma       rebook
adidas      610.615385   63.615385    17.923077  -279.307692
newbalance   63.615385  194.307692    67.769231  -256.076923
puma         17.923077   67.769231  1002.065934  -364.175824
rebook     -279.307692 -256.076923  -364.175824  2401.186813

#### Correlacion  (otras medidas de correlacion):

Correlacion y covarianza no son equivalentes. La correlacion puede ser alta cuando la covarianza es baja.

Si la correlacion es alta las variables se explican entre ellas.

    
Correlacion de SPEARMAN para variables cuantitativas


- Correlacion entre Series:
    * con Python: a.corr(b)
    * con Numpy: np.corrcoef(a,b)
    
    
- Correlacion en dataframe:
    * con python: historico_stock['puma'].corr(historico_stock['adidas'])
    * con Numpy: np.corrcoef(historico_stock)


NOTA: Para modelos de ML buscamos variables que tengan alta correlacion con la variable objetivo. 
Ademas las variables que se elijan tienen que tener poca correlacion entre ellas, puesto que si estan fuertemente correlacionadas una es redundante para el modelo. Si una explica a otra, me estaría sobrando. Esto se trabaja asi porque se intenta reducir el numero de variables que se incluyen en el modelo.

In [345]:
# Series 
a.corr(b) # con Python

0.022912925787156164

In [346]:
# Series
np.corrcoef(a,b) # con Nunpy

array([[1.        , 0.02291293],
       [0.02291293, 1.        ]])

In [347]:
# En el dataframe
historico_stock['puma'].corr(historico_stock['adidas']) # con python

0.022912925787156164

In [348]:
historico_stock['adidas'].corr(historico_stock['puma']) # con Python

0.022912925787156164

In [349]:
np.corrcoef(historico_stock) # con Numpy

array([[ 1.        , -0.23015239, -0.28464619, -0.54199706, -0.21349863,
        -0.12245221, -0.39250881, -0.0072403 , -0.44976302, -0.4861969 ,
        -0.4906814 , -0.223931  , -0.76505887, -0.57292581],
       [-0.23015239,  1.        ,  0.98121164,  0.91488834,  0.98607698,
         0.99213948,  0.98397068,  0.89742724,  0.00693609,  0.34623   ,
         0.82374278,  0.59364004,  0.72023828, -0.01526244],
       [-0.28464619,  0.98121164,  1.        ,  0.87856732,  0.93635224,
         0.95559908,  0.98529634,  0.93978079,  0.19727231,  0.51888307,
         0.91401539,  0.44138265,  0.80244799, -0.12676841],
       [-0.54199706,  0.91488834,  0.87856732,  1.        ,  0.93336451,
         0.88403395,  0.94709522,  0.66659526, -0.02921329,  0.27694237,
         0.75602242,  0.74701831,  0.79943921,  0.36238733],
       [-0.21349863,  0.98607698,  0.93635224,  0.93336451,  1.        ,
         0.99007075,  0.95932043,  0.82301111, -0.14661593,  0.1964334 ,
         0.72926716,  0.71665898,  0.64877077,  0.11025368],
       [-0.12245221,  0.99213948,  0.95559908,  0.88403395,  0.99007075,
         1.        ,  0.95446566,  0.88851037, -0.09808382,  0.24614231,
         0.75424036,  0.62863383,  0.62782888, -0.02981424],
       [-0.39250881,  0.98397068,  0.98529634,  0.94709522,  0.95932043,
         0.95446566,  1.        ,  0.86835744,  0.13142632,  0.45550999,
         0.88796454,  0.55796631,  0.8303302 ,  0.04428344],
       [-0.0072403 ,  0.89742724,  0.93978079,  0.66659526,  0.82301111,
         0.88851037,  0.86835744,  1.        ,  0.25873718,  0.55339625,
         0.86152461,  0.20189261,  0.64504082, -0.44977037],
       [-0.44976302,  0.00693609,  0.19727231, -0.02921329, -0.14661593,
        -0.09808382,  0.13142632,  0.25873718,  1.        ,  0.94039087,
         0.56990775, -0.6644079 ,  0.57210458, -0.4423298 ],
       [-0.4861969 ,  0.34623   ,  0.51888307,  0.27694237,  0.1964334 ,
         0.24614231,  0.45550999,  0.55339625,  0.94039087,  1.        ,
         0.81354064, -0.42876385,  0.77491387, -0.43451998],
       [-0.4906814 ,  0.82374278,  0.91401539,  0.75602242,  0.72926716,
         0.75424036,  0.88796454,  0.86152461,  0.56990775,  0.81354064,
         1.        ,  0.13682021,  0.93557368, -0.21201438],
       [-0.223931  ,  0.59364004,  0.44138265,  0.74701831,  0.71665898,
         0.62863383,  0.55796631,  0.20189261, -0.6644079 , -0.42876385,
         0.13682021,  1.        ,  0.22738242,  0.68828422],
       [-0.76505887,  0.72023828,  0.80244799,  0.79943921,  0.64877077,
         0.62782888,  0.8303302 ,  0.64504082,  0.57210458,  0.77491387,
         0.93557368,  0.22738242,  1.        ,  0.09649766],
       [-0.57292581, -0.01526244, -0.12676841,  0.36238733,  0.11025368,
        -0.02981424,  0.04428344, -0.44977037, -0.4423298 , -0.43451998,
        -0.21201438,  0.68828422,  0.09649766,  1.        ]])

#### Funciones agregadas

Permiten aplicar funciones estadisticas de bajo nivel (media, mediana, suma, moda, maximo, etc) al conjunto de filas de cada variable de un DF.

In [350]:
historico_stock.agg(['min', 'max','sum', 'mean'])
# Algo similar a describe pero puedo personalizar con las funciones que necesite.
# O limitarlo a las variables que quiera mostrar
# y tambien incluir funciones propias

      adidas  newbalance        puma      rebook
min      0.0        10.0   15.000000    9.000000
max    100.0        60.0  120.000000  200.000000
sum    336.0       434.0  900.000000  456.000000
mean    24.0        31.0   64.285714   32.571429

In [351]:
historico_stock[['adidas','puma']].agg(['min', 'max','sum', 'mean', coefPearson]) # funcion definida

                adidas        puma
min            0.00000   15.000000
max          100.00000  120.000000
sum          336.00000  900.000000
mean          24.00000   64.285714
coefPearson    1.02961    0.492418

#### Ordenar en DFs

In [352]:
historico_stock.sort_values(by='rebook', ascending =True)

      adidas  newbalance  puma  rebook
2017      10          35    15       9
2010       5          20   100      10
2012      35          27    77      10
2018      11          33    23      11
2011      15          33    67      19
2015      26          40    92      19
2019      20          35    41      19
2021      40          60    69      19
2013      21          19    80      20
2020      30          12    35      20
2014      15          25   120      29
2022     100          33    60      30
2016       8          52    91      41
2009       0          10    30     200

In [353]:
historico_stock.sort_values(by=['adidas','puma'], ascending =[True,False])

      adidas  newbalance  puma  rebook
2009       0          10    30     200
2010       5          20   100      10
2016       8          52    91      41
2017      10          35    15       9
2018      11          33    23      11
2014      15          25   120      29
2011      15          33    67      19
2019      20          35    41      19
2013      21          19    80      20
2015      26          40    92      19
2020      30          12    35      20
2012      35          27    77      10
2021      40          60    69      19
2022     100          33    60      30

#### Funciones para el Tratamiento de strings.


    Métodos de transformacion:
        - lower() pasa a minuscula
        - upper() pasa a mayuscula
        - capitalize() primera letra a mayuscula
        - title() primera letra de cada palabra a mayuscula (apitalize de cada palabra)
        - swapcase() cambia mayusculas por minusculas y viceversa
        - strip() quita espacios en blanco al comienzo y al final
        - lstrp() quita espacios a izquierda (comienzo)
        - rstrip() quita espacios a derecha (final)
    Métodos de condicion:
        - islower() si todo es minuscula
        - isupper() si todo es mayuscula
        - istitle() si primera letra de cada palabra es mayuscula y resto minuscula
        - startswith('letra/cadena') condicion: indica si la cadena comienza con la letra/cadena indicada como argumento
        
* Cuando se aplican sobre un DF, hay que hacer previamente la cohercion a string. Ej: .str.upper(). 
    (recordar que en DF los caracteres son object)

In [322]:
dfPersonas=pd.DataFrame(data={'nombre':['Jose lopez', 'MARTIN echenique', 'mercedes Moran', 'NURya rOCA'],
                  'edad':[37,45,16,17],
                  'provincia':['mADRID','Barcelona','Tarragona','sevilla'],
                  'codigoPostal':[28010,83105,88400,45999]})

In [368]:
dfPersonas

             nombre  edad  provincia  codigoPostal
0        Jose lopez    37     mADRID         28010
1  MARTIN echenique    45  Barcelona         83105
2    mercedes Moran    16  Tarragona         88400
3        NURya rOCA    17    sevilla         45999

In [323]:
dfPersonas['nombre'].str.lower() # pasa a minusculas SOLO VISUALIZACION SI QUIERO CAMBIAR TENGO QUE ASIGNARLO A LA VAR

0          jose lopez
1    martin echenique
2      mercedes moran
3          nurya roca
Name: nombre, dtype: object

In [324]:
dfPersonas['nombre'].str.upper() # pasa a mayusculas SOLO VISUALIZACION

0          JOSE LOPEZ
1    MARTIN ECHENIQUE
2      MERCEDES MORAN
3          NURYA ROCA
Name: nombre, dtype: object

In [325]:
dfPersonas['nombre'].str.capitalize() # solo capitaliza la primera palabra

0          Jose lopez
1    Martin echenique
2      Mercedes moran
3          Nurya roca
Name: nombre, dtype: object

In [326]:
dfPersonas['nombre'].str.title() # asi mejor

0          Jose Lopez
1    Martin Echenique
2      Mercedes Moran
3          Nurya Roca
Name: nombre, dtype: object

In [367]:
dfPersonas['nombre'].str.swapcase() # cambia mayusculas/minusculas

0          jOSE LOPEZ
1    martin ECHENIQUE
2      MERCEDES mORAN
3          nurYA Roca
Name: nombre, dtype: object

In [327]:
dfPersonas['nombre'].str.strip() # quita espacios delante y detras SOLO VISUALIZACION

0          Jose lopez
1    MARTIN echenique
2      mercedes Moran
3          NURya rOCA
Name: nombre, dtype: object

In [328]:
dfPersonas['nombre'].str.lstrip() # quita espacios delante

0          Jose lopez
1    MARTIN echenique
2      mercedes Moran
3          NURya rOCA
Name: nombre, dtype: object

In [329]:
dfPersonas['nombre'].str.rstrip() # quita espacios atras

0          Jose lopez
1    MARTIN echenique
2      mercedes Moran
3          NURya rOCA
Name: nombre, dtype: object

In [358]:
dfPersonas['nombre'].str.strip().str.upper() # strip anidado con upper

0        JOSE
1      MARTIN
2    MERCEDES
3       NURYA
Name: nombre, dtype: object

In [362]:
dfPersonas['nombre'].str.isupper()

0    False
1    False
2    False
3    False
Name: nombre, dtype: bool

In [363]:
dfPersonas['nombre'].str.islower()

0    False
1    False
2    False
3    False
Name: nombre, dtype: bool

In [364]:
dfPersonas['nombre'].str.istitle()

0    False
1    False
2    False
3    False
Name: nombre, dtype: bool

In [342]:
dfPersonas[dfPersonas['nombre'].str.startswith('M')][['nombre']] # comienzo con caracter (hay otro con m)

             nombre
1  MARTIN echenique

In [366]:
dfPersonas[dfPersonas['nombre'].str.startswith('MARTIN')][['nombre']] # comienzo con cadena

             nombre
1  MARTIN echenique

In [340]:
# condicion logica con | (or)
dfPersonas[(dfPersonas['nombre'].str.startswith('m')) | (dfPersonas['nombre'].str.startswith('M'))][['nombre']]

             nombre
1  MARTIN echenique
2    mercedes Moran

In [361]:
# cambio la condicion aplicando primero capitalize y asi no tengo que usar or
# el primer [] contiene la condicion de filtro
# el segundo [] indica lo que quiero visualizar (campo) y como (transformacion). El doble [] me da error. lo dejo con uno.

dfPersonas[dfPersonas['nombre'].str.capitalize().str.startswith('M')]['nombre'].str.title()

1    Martin Echenique
2      Mercedes Moran
Name: nombre, dtype: object

#### Transformacion de variables. Variables DUMMY y BINNING

-  Creacion de variables dummy's: pasar de una categorica a variable numerica booleana. 
    Ej: Muy Alto Alto, Bajo, Muy Bajo --> 1,2,3,4 cada una de ellas 0/1

-  Creacion de Binning's: pasar de variable numerica a categorica. Seria lo contrario a dummy.

In [359]:
dfPersonas=pd.DataFrame(data={'sexo':['M','H','M','H'],
                      'estatura':[150,200,195,145]},
                      index=['jose','maria','juan','monica'])

In [360]:
df = pd.DataFrame(data = {'sexo':['M','H','NB','M','H'],
                          'estatura':[150,200,175,195,145],
                          'NumPelos':[1000,2000,2305,0,1152]},
                 index=['jose','maria','andrea','juan','monica'])
df

       sexo  estatura  NumPelos
jose      M       150      1000
maria     H       200      2000
andrea   NB       175      2305
juan      M       195         0
monica    H       145      1152

In [361]:
dfPersonas

       sexo  estatura
jose      M       150
maria     H       200
juan      M       195
monica    H       145

In [362]:
# Dummy
pd.get_dummies(dfPersonas['sexo']) 
# creara la misma cantidad de variables numericas que categorias distintas tenga la variable categorica. Binariza la variable.

        H  M
jose    0  1
maria   1  0
juan    0  1
monica  1  0

In [363]:
# Creo y Asigno las variables con dummies.

In [364]:
dfPersonas[['sexoH','sexoM']]=pd.get_dummies(dfPersonas['sexo'])
dfPersonas

       sexo  estatura  sexoH  sexoM
jose      M       150      0      1
maria     H       200      1      0
juan      M       195      0      1
monica    H       145      1      0

In [365]:
# Binning's

"""
bajo < 150
normal 150 -170
alto (170-180]
muy alto > 180
"""

import math
pd.cut(x=df['estatura'], bins=[-math.inf,150,170,180,math.inf],labels=['bajo','normal','alto','muy alto'])
# Observar que se creo como categorica ordenada

jose          bajo
maria     muy alto
andrea        alto
juan      muy alto
monica        bajo
Name: estatura, dtype: category
Categories (4, object): ['bajo' < 'normal' < 'alto' < 'muy alto']

In [366]:
# Asigno la variable binning a una nueva columna del DF
dfPersonas['CatEstatura']=pd.cut(x=dfPersonas['estatura'], bins=[-math.inf,150,170,180,math.inf], labels=['bajo','normal','alto','muy alto'])

dfPersonas

       sexo  estatura  sexoH  sexoM CatEstatura
jose      M       150      0      1        bajo
maria     H       200      1      0    muy alto
juan      M       195      0      1    muy alto
monica    H       145      1      0        bajo

In [367]:
pd.cut(x=df['NumPelos'], bins=3, labels=['calvo','pelon','normal'])
# tambien la creo como variable categorica ordenada

jose       pelon
maria     normal
andrea    normal
juan       calvo
monica     pelon
Name: NumPelos, dtype: category
Categories (3, object): ['calvo' < 'pelon' < 'normal']

#### Lectura y escritura de ficheros

Pandas permite leer y escribir en los siguientes formatos:

* csv/txt: pd.read_csv()
* Excel (.xlsx, .xls): pd.read_excel()
* Json
* HTML
* SQL

In [ ]:
#IMPORTAR

pd.read_csv('./datos.csv').shape
pd.read_csv('./datos.csv') # Ver parametros: index, sep='\t' (separados por tab)

pd.read_excel('./datos.xlsx', sheet_name='nombre_hoja')
pd.read_excel('./datos.xlsx', sheet_name=0) # carga la primera hoja
pd.read_excel('./datos.xlsx', sheet_name=1) # carga la segunda hoja

pd.read_json ('./datos.fichero.json') # Estructura JavaS formato web 

pd.read_html()[0]  FOTO

In [ ]:
# EXPORTAR

df.to_csv('./datos.csv', index=False, sep=';') # Exportacion a csv sin indice de fila y con ; de separador

df.to_excel('./datos.xls', sheet_name='Hoja13')

df.to_json('./datos.json)

df.to_html('./datos.html)

In [369]:
# para sql

from sqlalchemy import create_engine

In [371]:
engine = create_engine('sqlite:///:memory:')

In [ ]:
df.to_sql('fichero.sql', engine) # para exportar

In [ ]:
pd.read_sql('datos.sql', con=engine) # para importar

In [ ]:
pd.read_csv('./datos.csv').shape

In [ ]:
pd.read_csv('./datos.csv').dtypes

In [ ]:
## Creamos unos datos en formato Json
[{'direccion':'castellana 256',
'ciudad':'madrid',
'empleado':'3064',
'id':'1',
'nombre':'Zara',
'pais':'España'}
{'direccion':'366 21 st Alvaro',
'ciudad':'San Francisco',
'empleado':'263',
'id':'4',
'nombre':'Rivally Soft',
'pais':'EEUU'}
{'direccion':'Av 5th 465',
'ciudad':'Santa Monica',
'empleado':'674',
'id':'3',
'nombre':'Heit LS',
'pais':'EEUU'}] ## crear fichero.json

#### Manejo de campos alfanumericos.

EJERCICIO: DESCOMPONER UN DNI EN NRO Y LETRA

In [415]:
personal=pd.DataFrame(data={'nombre':['Pepe', 'Juan', 'Lorenzo', 'Alex'],
                           'dni':['48765378F', '9896572D','04857623M','23785637A']})
# coloco dni de diferente longitud

In [416]:
personal

    nombre        dni
0     Pepe  48765378F
1     Juan   9896572D
2  Lorenzo  04857623M
3     Alex  23785637A

In [417]:
# Obtengo el numero quitando el ultimo caracter y convirtiendo a entero
personal['numero']=personal['dni'].apply(lambda x: x[0:-1]).astype(np.int64)
personal

    nombre        dni    numero
0     Pepe  48765378F  48765378
1     Juan   9896572D   9896572
2  Lorenzo  04857623M   4857623
3     Alex  23785637A  23785637

In [418]:
personal.dtypes

nombre    object
dni       object
numero     int64
dtype: object

In [419]:
personal['letra']=personal['dni'].apply(lambda x: x[-1])
personal

    nombre        dni    numero letra
0     Pepe  48765378F  48765378     F
1     Juan   9896572D   9896572     D
2  Lorenzo  04857623M   4857623     M
3     Alex  23785637A  23785637     A

In [423]:
# si quiero el numero en formato caracter normalizado en longitud
personal['numero_str']=personal['numero'].astype(str).str.rjust(8,'0')
personal # perfect!!

    nombre        dni    numero letra numero_str
0     Pepe  48765378F  48765378     F   48765378
1     Juan   9896572D   9896572     D   09896572
2  Lorenzo  04857623M   4857623     M   04857623
3     Alex  23785637A  23785637     A   23785637

In [424]:
personal.dtypes

nombre        object
dni           object
numero         int64
letra         object
numero_str    object
dtype: object